{
  "articleContent": "<div>\n<div data-page-id=\"PQ1xdRVcTorcs2x5LLDcsix9nGA\" data-lark-html-role=\"root\" data-docx-has-block-data=\"false\">\n<div class=\"ace-line ace-line old-record-id-RNQidCWDiouK83xrxdlcYVPFnRf\"><span style=\"font-family: 微软雅黑; font-size: 14pt;\">Dear Rovers,</span></div>\n<div class=\"ace-line ace-line old-record-id-TziudwcZxoUiJpxFFwecb8REnhd\">&nbsp;</div>\n<div class=\"ace-line ace-line old-record-id-Y2aLdqzNooAKwBxMordc0Arun3c\"><span style=\"font-family: 微软雅黑; font-size: 14pt;\">Since the start of Version 1.1 CBT, our work has been overshadowed by unauthorized content leaks. These leaks have spread fast and wide, including story cutscenes, storyboard drafts, character concept art, and even discarded environment assets. Many of you have expressed frustration at encountering leaked content despite your efforts to avoid it, largely due to platform algorithms. These unverified leaks have dulled the impact of our official version updates and caused major spoilers, undermining the experience we've carefully crafted for you.</span></div>\n<div class=\"ace-line ace-line old-record-id-SGF8ddjN8oC51AxTi4ScVoQZnTe\">&nbsp;</div>\n<div class=\"ace-line ace-line old-record-id-OAVXd8qgUoxlV9xLo0lczfAmnAc\"><span style=\"font-family: 微软雅黑; font-size: 14pt;\">Last month, we issued a statement condemning leaks and received widespread support from our community. Thanks to this, many leakers realized the harm they were causing and ceased their activities. Unfortunately, with the launch of the Version 1.4 CBT server, we are once again facing severe leaks of unreleased content.</span></div>\n<div class=\"ace-line ace-line old-record-id-PZ4SdZnA1on0fnxc4gkc6nyonaf\">&nbsp;</div>\n<div class=\"ace-line ace-line old-record-id-BHKPdqGTJodRA6xf580cZRkTnuh\"><span style=\"font-family: 微软雅黑; font-size: 14pt;\">Developing a new version is meticulous and time-consuming. Character creation, for example, begins several versions ahead with user research, followed by months of design, development, testing, and fine-tuning. Before each update, we conduct a closed beta test to ensure the final product meets player expectations. Promotion only begins when everything is ready, with methodically scheduled moments to provide the best experience. We believe this approach ensures consistent, polished releases, allowing players and content creators to fully engage with each update. Unfortunately, leaks disrupt this process, taking away the element of surprise and undermining the hard work of our team members who put their hearts into every detail.</span></div>\n<div class=\"ace-line ace-line old-record-id-VZNAdC9f2obnrVx5fZFcwul3n8d\">&nbsp;</div>\n<div class=\"ace-line ace-line old-record-id-EsUpdWd9No8coWxppELcCuQWnLd\"><span style=\"font-family: 微软雅黑; font-size: 14pt;\">In response to the damage caused by these leaks, we have implemented stronger measures to prevent future incidents. These measures include reinforcing confidentiality in our test servers, issuing formal warnings, and collaborating with various content-sharing platforms to remove unauthorized material. Additionally, we have initiated legal proceedings against severe breaches of intellectual property, which are currently progressing through the courts. We are committed to defending our work against unauthorized distribution and are prepared to take further legal actions as needed.</span></div>\n<div class=\"ace-line ace-line old-record-id-FTgpd4Y1rontJQxIrigc4u8Ynac\"><span style=\"font-family: 微软雅黑; font-size: 14pt;\"> </span></div>\n<div class=\"ace-line ace-line old-record-id-IaBTdD4efo1QtUxK5qYcJmE1ndf\"><span style=\"font-family: 微软雅黑; font-size: 14pt;\">Now, with Version 1.4 CBT on track and preparations for official marketing well underway, the team is focused on developing our next major update&mdash;a brand-new area that we've been designing based on all the feedback from you since launch. This new area is a true co-creation between us and the player community; in a way, it belongs to all of us. We call on all players to cherish this creative journey together. Please help us protect our hard work by standing against leaks. We will continue gathering evidence against those who steal and distribute our unreleased materials. If you encounter any leaks, we encourage you to report them to us via our dedicated email: <a href=\"mailto:legal@kurogames.com\" data-lark-is-custom=\"true\">legal@kurogames.com</a>.</span></div>\n<div class=\"ace-line ace-line old-record-id-HWd3doF6jolXZRxXN9jcV8SZnHf\"><span style=\"font-family: 微软雅黑; font-size: 14pt;\"> </span></div>\n<div class=\"ace-line ace-line old-record-id-KWZ1d47tfouM7AxYDC1cwZjNn8g\"><span style=\"font-family: 微软雅黑; font-size: 14pt;\">Once again, we extend our deepest thanks to all of you for your love and support.</span></div>\n<div class=\"ace-line ace-line old-record-id-A3JddoNSjos4A2xigwpcaJqcnUd\">&nbsp;</div>\n<div class=\"ace-line ace-line old-record-id-A66Gd4STQoeunYxqpoEcL7cRnLe\"><span style=\"font-family: 微软雅黑; font-size: 14pt;\">Wuthering Waves Dev Team</span></div>\n<div class=\"ace-line ace-line old-record-id-OcPNdZbEBo3qbGxXMwucpZDCnKh\"><span style=\"font-family: 微软雅黑; font-size: 14pt;\">October 21, 2024</span></div>\n</div>\n</div>",
  "articleCover": "",
  "articleId": 1535,
  "articleTitle": "Developer's Message",
  "articleType": 58,
  "articleTypeName": "Notice",
  "contentCover": "",
  "gameId": "G152-en",
  "startTime": "2024-10-21 21:00:44",
  "articleDesc": "",
  "createTime": "2024-10-21 21:01:09",
  "suggestCover": "",
  "top": 0
}