{
  "articleContent": "<div>\n<p><span style=\"font-size: 14pt;\">Dear Rovers,</span><br /><br /><span style=\"font-size: 14pt;\">As part of our commitment to provide a fair and positive gaming experience for all Rovers in \"Wuthering Waves\", we will hold the principles below observed throughout our service:</span><br /><br /><br /><br /><span style=\"font-size: 14pt;\">1.<strong>Strict Prohibition of the Disruption of Gaming Experience with Third-party Applications.&nbsp;</strong>The use of illegal third-party tools such as cheating programs, accelerators, macro commands, etc. for the purpose of gaining unfair advantages (cheat) in game, including but not limited to automatic farming, cooldown alteration, invulnerability mode, teleportation, modification of game data, etc. is prohibited in all forms. Upon proving such use, we will immediately take actions, including but not limited to removal of illegal gains, account suspension, and permanent ban, depending on the degree and frequency of such use.</span></p>\n<p><br /><br /><span style=\"font-size: 14pt;\">2.<strong>Strict Prohibition of the Sale, Purchase, or Transfer of Accounts.&nbsp;</strong>Rovers are reminded to stay alert to and reject any transaction or sharing of accounts. The loss or dispute arising otherwise shall be solely borne by Rovers pursuing those actions.</span></p>\n<p><br /><br /><span style=\"font-size: 14pt;\">3.<strong>Strict Prohibition of the Sale, Purchase, or Transfer of Test Qualifications.&nbsp;</strong>Rovers are reminded to cherish their test qualifications and refrain from access to test qualifications via unofficial methods, lest unnecessary losses arise.</span><br /><br /><br /><br /><span style=\"font-size: 14pt;\">We have always been committed to maintaining a fair gaming experience in Wuthering Waves for all Rovers. In the event of any violation of the above principles, the relevant Rover's testing qualification will be immediately revoked. In the meantime, Rovers are encouraged to report any violations by contacting our [Customer Service]. Each report will be taken seriously and we will take severe action against any disruptive behavior.</span><br /><br /><br /><br /><span style=\"font-size: 14pt;\">To contact us, join our official discord channel:&nbsp;<span style=\"color: #e03e2d;\"><a style=\"color: #e03e2d;\" href=\"https://discord.com/invite/wutheringwaves\">https://discord.gg/wutheringwaves</a></span>&nbsp;and message our official Discord Customer Service account: Breezes#7797</span><br /><br /><span style=\"font-size: 14pt;\">Or email us at: wutheringwaves_ensupport@kurogame.com&nbsp; &nbsp;</span><br /><br /><br /><br /><span style=\"font-size: 14pt;\">In order to maintain a fair and positive gaming experience in Wuthering Waves, we sincerely request all Rovers' cooperation. Thank you for your understanding and support!</span><br /><br /><br /><br /></p>\n<p style=\"text-align: right;\"><br /><strong><span style=\"font-size: 14pt;\">Wuthering Waves Dev Team</span></strong></p>\n<p style=\"text-align: right;\">&nbsp;</p>\n<p style=\"text-align: right;\">&nbsp;</p>\n<p style=\"text-align: right;\">&nbsp;</p>\n</div>",
  "articleCover": "",
  "articleId": 191,
  "articleTitle": "Fair Gaming Policy",
  "articleType": 58,
  "articleTypeName": "Notice",
  "contentCover": "",
  "gameId": "G152-en",
  "startTime": "2023-04-24 10:55:00",
  "createTime": "2023-04-19 10:00:57",
  "top": 0
}