{
  "articleContent": "<div><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://hw-media-cdn-mingchao.kurogame.com/object/1735574400000/tuhlank3b1pt0258z2-1735652832463.jpg\" width=\"800\" height=\"450\" data-media-source=\"production_G152_en\" data-desc=\"succ\">\n<div><br>Dear Rovers,<br>Thank you for your continued support. We are excited to announce that Version 2.0: All Silent Souls Can Sing will become available soon!</div>\n<div>&nbsp;</div>\n<div>[Maintenance Time &amp; Compensation Details]<br>✦Maintenance Time: 2025-01-02 04:00 to 2025-01-02 11:00 (UTC+8)<br>✦Maintenance Compensation: Astrite x300, Crystal Solvent x2<br>✦Compensation Eligibility: Create a character and unlock the Mails feature before 2025-01-02 04:00 (UTC+8). The compensation can be claimed before the next version update.<br>※In the event that the maintenance is extended, the dev team will issue a follow-up notice and adjust the compensation accordingly.</div>\n<div>&nbsp;</div>\n<div>✦Bug Fixes Compensation: Astrite x300<br>✦Compensation Eligibility: Create a character and unlock the Mails feature before 2025-01-02 04:00 (UTC+8). The compensation can be claimed before the next version update.</div>\n<div>&nbsp;</div>\n<div>[Version 2.0 Preview]<br>✦New Region✦<br>Rinascita<br>Ragunna, in southern Rinascita, holds the closest bond with their Sentinel Imperator among the nation's many city-states. Most Ragunnesi worship the Sentinel, viewing Common Echoes as divine blessings. Ragunna is also home to the Order of the Deep, widely regarded as the Sentinel's earthly emissaries.<br>The Black Shores report that the Threnodian in Ragunna remains dormant. In recent years, however, even Sentinel Imperator has fallen silent, no longer speaking directly to the Ragunnesi...</div>\n<div>&nbsp;</div>\n<div>※When Version 2.0 goes live, Rovers who reach Union Level 14 and complete Main Quest Chapter I Act III \"Ominous Star\" can access Main Quest Fast Track \"Next Stop: Rinascita\" to unlock and participate in Main Quest Chapter II Prologue \"Through the Sea Thou Break.\"</div>\n<div>&nbsp;</div>\n<div>✦New Resonators✦<br>5-Star Resonator: Carlotta (Glacio)<br>The second daughter of Montelli and an art investor unbound by convention, Carlotta moves seamlessly through social circles and business transactions while quietly handling the family's unspeakable \"troubles\" in secret.<br>The blooming of a \"gem,\" the taking of a life&mdash;In her own name, she reshapes reality, giving it a new dimension.<br>✦Combat Roles: Main Damage Dealer, Resonance Skill DMG<br>※Obtainable through the [When Silence Tolls] Featured Resonator Convene.</div>\n<div>&nbsp;</div>\n<div>5-Star Resonator: Roccia (Havoc)<br>Assistant, prop master, and improv comedian, Roccia is always there to make sure the Fool's Troupe is at the ready.<br>The Magic Box she carries appears to hold the world, or perhaps she had recreated a world inside the box.<br>✦Combat Roles: Concerto Efficiency, Heavy Attack DMG, Traction, Havoc DMG Amplification, Basic Attack DMG Amplification<br>※Obtainable through the [Stage in the Box] Featured Resonator Convene.</div>\n<div>&nbsp;</div>\n<div>✦New Weapons✦<br>5-Star Weapon: The Last Dance (Pistols)<br>The radiant crystals, ever shattering and reshaping, beckon you into a treacherous dance, a gamble where life is the wager. Cortado, cortado... relentlessly draw each other in until all we can hear are our quivers. When the crimson finale arrives, remember, death comes for all.<br>※Obtainable through the [The Last Dance] Featured Weapon Convene.</div>\n<div>&nbsp;</div>\n<div>5-Star Weapon: Tragicomedy (Gauntlets)<br>The joys and sorrows of life dance in an endless circle; pain and tears shift in an instant into a carnival.<br>※Obtainable through the [Tragicomedy] Featured Weapon Convene.</div>\n<div>&nbsp;</div>\n<div>4-Star Weapon: Call of the Abyss (Rectifier)<br>Held by the keepers of this land, this scepter was once a symbol of dominion over its people and the architectural marvels they achieved. However, it has long lost its luster, and its grandeur blends into the ripples of the pipe organ melodies of Rinascita.<br>※Obtain the weapon and its Crafting Recipe by completing Exploration Quests \"Shadow of the Towers: Twilight Rise,\" \"Shadow of the Towers: Resounding Rise,\" and \"Shadow of the Towers: Command Rise.\"</div>\n<div>&nbsp;</div>\n<div>4-Star Weapon Series (Poetry and Paean): Meditations on Mercy (Broadblade), Fables of Wisdom (Sword), Romance in Farewell (Pistols), Legend of Drunken Hero (Gauntlets), Waltz in Masquerade (Rectifier)<br>※Obtain the weapons' Crafting Recipes while exploring Rinascita.</div>\n<div>&nbsp;</div>\n<div>✦New Echoes✦<br>Hecate, Lorelei, Dragon of Dirge, Sentry Construct, Questless Knight, Diurnus Knight, Nocturnus Knight, Abyssal Gladius, Abyssal Mercator, Abyssal Patricius, Chop Chop, Vitreum Dancer, Cuddle Wuddle, Chop Chop: Leftless, Chop Chop: Rightless, Chop Chop: Headless, Fae Ignis, Nimbus Wraith, Hocus Pocus, Lottie Lost, Diggy Duggy, Frostscourge Stalker, Voltscourge Stalker, Galescourge Stalker, Chest Mimic, Nightmare: Feilian Beringal, Nightmare: Impermanence Heron, Nightmare: Thundering Mephis, Nightmare: Tempest Mephis, Nightmare: Crownless, Nightmare: Inferno Rider, Nightmare: Mourning Aix</div>\n<div>&nbsp;</div>\n<div>✦New Stories✦<br>Main Quest Chapter II: Even When Divinity Remains Silent.<br>As you looked into the repaired Tethys System for ways to solve Abby's bodily issues, you stumbled upon a Beacon you had set for yourself. Your past self pointed you in the direction of the distant land across the sea.<br>Time to set forth for Ragunna, Rover. Brave the storms and undercurrents to reach the grand celebration that awaits&mdash;and to honor the pact you made long ago.</div>\n<div>Main Quest Chapter II Prologue: Through the Sea Thou Break<br>Main Quest Chapter II Act I: The Sacred Breeze So Often Breathes<br>Main Quest Chapter II Act II: Veils Off in Sun or Shadow<br>Main Quest Chapter II Act III: What Yesterday Wept, Today Doth Sing✦Duration: Permanently available after the Version 2.0 update<br>※When Version 2.0 goes live, Rovers who reach Union Level 14 and complete Main Quest Chapter I Act III \"Ominous Star\" can access Main Quest Fast Track \"Next Stop: Rinascita\" to unlock and participate in Main Quest Chapter II Prologue \"\"Through the Sea Thou Break.\"\" Chapter II progress is saved separately from Chapter I progress. Taking on Chapter II early does not affect your progress in Chapter I.<br>※We recommend completing Chapter I Act VIII \"To the Shore's End\" before starting Chapter II for optimal experience.</div>\n<div>&nbsp;</div>\n<div>Carlotta's Companion Story: If On a Rainy Night a Family<br>The bitter night lingers for the restless. An invitation from the Montelli family pulls you into its past, where new and old, balance and change collide. In the freest place of Ragunna, the host of the invitation awaits your arrival.<br>✦Duration: Permanently available after the Version 2.0 update<br>✦Eligibility: Reach Union Level 20 and complete Main Quest Chapter II Act III \"What Yesterday Wept, Today Doth Sing.\"</div>\n<div>&nbsp;</div>\n<div>Roccia's Companion Story: Starry is the Night<br>What do the exiled \"pilgrims\" truly need? Food? Shelter? And perhaps, a ray of starry light, a symbol of hope? Now, with Roccia by your side, the time has come to seek out that light...<br>✦Duration: Permanently available after 2025-01-23 10:00 (server time)<br>✦Eligibility: Reach Union Level 20 and complete Main Quest Chapter II Act III \"What Yesterday Wept, Today Doth Sing.\"</div>\n<div>&nbsp;</div>\n<div>✦New Events✦<br>[Rinascita] Regional Events<br>Participate in Tales of the Isles: Area Exploration Event, where you collect Stamps to increase Event Level, earning rewards and unlocking Amidst the Sea of Clouds.<br>Participate in Traces of Tides: Photo Collection Event, where you explore Rinascita and capture beautiful moments.<br>✦Duration: Version 2.0 update - 2025-02-12 03:59 (server time)</div>\n<div>&nbsp;</div>\n<div>[Gifts of Joyous Tunes] 7-Day Login Event<br>During the event, log in daily to claim the day's login rewards.<br>✦Rewards: Radiant Tide x5, Lustrous Tide x5<br>✦Duration: Version 2.0 update - 2025-02-12 03:59 (server time)</div>\n<div>&nbsp;</div>\n<div>[Dances For Spring's Return] Companion Invitation Login Event<br>During the event, you can invite one Companion to join you in the event every day. After the invitation, you can claim the corresponding rewards on the event page. Complete all invitations to claim Sanhua's exclusive Outfit, \"Exorcistic Adjuration.\"<br>✦Rewards: Exorcistic Adjuration x1, Crystal Solvent x10, Premium Sealed Tube x30, Premium Tuner x100, Premium Resonance Potion x10, Premium Energy Core x10<br>✦Duration: 2025-01-23 10:00 - 2025-02-13 03:59 (server time)</div>\n<div>&nbsp;</div>\n<div>[Celebration Aftertunes] Gratitude for Companionship<br>Food, drink, songs, and laughter&mdash;amid the season of revelry, we keep the festivities alive without pause. How do you like your time in Rinascita, Rover?<br>Aftertunes of the celebration still linger, and now, a couple of friends are preparing to send you their heartfelt wishes and gifts...<br>✦Rewards: Astrite x1600<br>✦Duration: 2025-01-29 00:00 - 2025-02-13 03:59 (UTC+8)</div>\n<div>&nbsp;</div>\n<div>[Although Colors Have No Form] Featured Co-op Combat Event<br>Claudia asks you to investigate the world within the painting and gives you a protective talisman. Within the painted world, the talisman transforms into various Echoes to assist you.<br>✦Duration: 2025-01-09 10:00 - 2025-01-30 03:59 (server time)</div>\n<div>&nbsp;</div>\n<div>[Wuthering Exploration] Featured Exploration Event: Nimbus Sanctum<br>Complete daily Survey Tasks to obtain Survey Points, which can be exchanged for various rewards.<br>✦Duration: 2025-01-16 10:00 - 2025-01-30 03:59 (server Time)</div>\n<div>&nbsp;</div>\n<div>[John Wicktorio: No Debts for Old Men] Featured Combat Event<br>During the event, you will enter a special sphere to battle waves of enemies within a set time limit, with the aid of unique buffs.<br>✦Duration: 2025-01-23 10:00 - 2025-02-09 03:59 (server time)</div>\n<div>&nbsp;</div>\n<div>[Lollo Campaign: Comeback] Featured Commission Event<br>Complete Lollo Campaigns to obtain Lollo Stamps, each of which can be exchanged for a special delivery from Lollo Helper, granting you one spin on the wheel lottery.<br>✦Duration: 2025-01-30 10:00 - 2025-02-13 03:59 (server time)</div>\n<div>&nbsp;</div>\n<div>[Pincer Maneuver Warriors] Recurring Combat Event<br>Challenge waves of powerful enemies by controlling two teams with special buffs across two separate simulated battlefields.<br>✦Duration✦<br>Pincer Maneuver Warriors Ⅲ: Version 2.0 update - 2025-01-23 09:59 (server time)<br>Pincer Maneuver Warriors Ⅳ: 2025-01-23 10:00 - 2025-02-12 11:59 (server time)</div>\n<div>✦Other New Content✦<br>✦New Tactical Hologram Challenges: Tactical Hologram - Phantom Pain<br>✦New Gameplay Feature: Amidst the Sea of Clouds<br>✦New Phantom Echoes: Phantom - Sentry Construct, Phantom - Questless Knight, Phantom - Vitreum Dancer<br>✦New Feature: Outfits (New Outfits: Exorcistic Adjuration, Peach Blossom)<br>※Participate in Glamour Couture to try out Jinhsi's Outfit \"Peach Blossom.\"<br>※Participate in Dances For Spring's Return: Companion Invitation Login Event to claim Sanhua's Signature Outfit \"Exorcistic Adjuration\" for free.</div>\n<div>&nbsp;</div>\n<div>[Adjustments and Optimizations]<br>✦Resonators and Weapons✦<br>Outfits:<br>New Feature - Resonator Outfits<br>- Give the current Resonator a new look by switching to a new Outfit.<br>- Switching between Outfits does not change the Resonator's stats.<br>- After switching to a new Outfit, you can equip the Resonator with the Weapon Projection associated with the Outfit.</div>\n<div>&nbsp;</div>\n<div>[Injured] Visual Effects:<br>Added [Injured] Visual Effects<br>- When Resonators have been in combat for over 20 seconds and have taken more than 7 hits, taking another hit triggers the [Injured] visual effects.<br>- To remove the [Injured] visual effects, use Fast Travel or switch the current Resonator off the field and stay out of combat for 20 seconds.<br>※Please note that in Version 2.0, the [Injured] visual effects are not available for Resonators who engage in combat wearing Outfits other than their original ones. We expect to include [Injured] visual effects for Resonator Outfits in Version 2.1.<br>※Please note that the [Injured] visual effects is enabled by default in Version 2.0. We expect to add a toggle option for this feature in Version 2.1.</div>\n<div>&nbsp;</div>\n<div>✦Features✦<br>Synthesis:<br>New Feature - Synthesis on the Go<br>- Access Synthesis on your Terminal page.<br>- Use Synthesis - Purification to quickly synthesize materials of different Rarities; you will have a clear view of the current quantities of the materials.<br>- Use Synthesis - Conversion to convert two materials into one new material that is in the same category and of the same Rarity.</div>\n<div>&nbsp;</div>\n<div>Change Appearance:<br>New Feature - Change Appearance<br>- You can switch between the two Rovers via Settings &gt; Other &gt; Player Setting.<br>- This feature has a 24-hour cooldown.</div>\n<div>&nbsp;</div>\n<div>Immersion Mode:<br>New Feature - Immersion Mode<br>- Enable Immersion Mode via Settings &gt; Other &gt; HUD Interface. Certain HUD information will be hidden.<br>- Disable Immersion Mode with the keyboard shortcut or the icon in the top-left corner of the main screen.</div>\n<div>&nbsp;</div>\n<div>Archive of Melodies:<br>New Feature - Archive of Melodies<br>- Unlock in-game music tracks by delivering Melody Boxes to Aria Mummers.<br>- Aria Mummers can play any track you select from your Archive of Melodies.<br>- Set a selected track as the background music around Aria Mummer.</div>\n<div>&nbsp;</div>\n<div>Exploration Progress:<br>Optimized Exploration Progress<br>- Increase Exploration Progress in each region to unlock rewards.<br>- Reach the required Exploration Progress percentage in a region to obtain an Exploration Report.<br>- Track Quest, Challenge, or Item Collection progress for each region.</div>\n<div>&nbsp;</div>\n<div>✦Leveling✦<br>Limited-Time Early Access to Challenges:<br>Opened limited-time early access to challenges that drop desired materials<br>- Gain early access to and participate in certain Weekly Challenges and Boss Challenges to obtain materials for Resonator Ascension.<br>- The Weekly Challenges and Boss Challenges open for early access are subject to which Resonators feature in the current Featured Resonator Convenes.<br>※This feature is designed for your convenience. Please note that using this feature may result in spoilers.</div>\n<div>&nbsp;</div>\n<div>Data Bank:<br>Raised the level cap of the Data Bank to Lv.24.<br>※When your Data Bank reaches Lv.21, the drop rate of 5-Star Echoes increases to 100%.</div>\n<div>&nbsp;</div>\n<div>Daily Activity:<br>- Added a new Activity Points task - Login.<br>- Adjusted the list of Activity Points tasks (deletions and additions were made).</div>\n<div>&nbsp;</div>\n<div>✦Challenges, Puzzles, &amp; Events✦<br>- Adjusted the rules under which red dots appear regarding Somnium Labyrinth: Somnoire Adventure Event.</div>\n<div>&nbsp;</div>\n<div>✦Controls✦<br>- Added keyboard shortcuts for Discarding or Locking a selected Echo in Keyboard &amp; Mouse mode.<br>- Added Synthesis to the Quick Access Wheel menu.<br>- Added keyboard shortcuts for Discarding or Locking a selected Echo in Controller mode.<br>- Optimized the display of the icons in the top right corner of the main interface in Controller mode.<br>- Added a feature in Controller mode that allows you to bring up information about the location being tracked by pressing down the left joystick with the Map page displayed.<br>- Optimized the controller vibration when using DualShock&reg;4, DualSense&reg;, and DualSense Edge&trade; to play the PC version of the game.</div>\n<div>&nbsp;</div>\n<div>✦UI✦<br>- Optimized the layout and interactivity of the Map interface.<br>- Optimized the display of the Login screen.<br>- Optimized the display of the Activity screen.</div>\n<div>&nbsp;</div>\n<div>✦Graphics &amp; Performance✦<br>- Added real-time volumetric clouds, making the clouds in the new region, Rinascita, look more realistic.<br>- Added dynamic color adjustments, lending vibrant colors to the vegetation in Rinascita.<br>- Added special visual effects to better present polar-day and polar-night phenomena, in order to create an atmosphere or a mood suitable for a specific scene.<br>- Optimized the visual effects and interactivity of certain water surfaces and beaches.<br>- Optimized CPU usage for NPCs, allowing more NPCs to appear on the screen at the same time; your device will perform more smoothly when displaying the same number of NPCs.<br>- Optimized the lighting effects on Mobile when the graphic quality is set to \"Ultra Performance\" or \"Performance.\"</div>\n<div>&nbsp;</div>\n<div>✦Others✦<br>- Added the option to filter Echoes by Resonance Effect. This option is available in all Echo management interfaces.<br>- Added Item \"Salted Milk Tea Recipe.\" In Version 2.0, the item can be obtained through exchanges from KU-Money (NPC) in the Black Shores - Black Shores Archipelago area.<br>- Adjusted the requirements for obtaining Battle Skills III's \"\"Deal X DMG with one attack to an enemy\"\" Trophies. In Version 2.0, you obtain all the Trophies with a required DMG lower than the DMG dealt by a particular attack.<br>- Adjusted the background music for the login screen.<br>- Optimized the descriptions of certain in-game settings and functions.</div>\n<div>&nbsp;</div>\n<div>[Bug Fixes]<br>Resonators &amp; Weapons<br>- Fixed an issue where the casting of Resonator Camellya's Resonance Skill \"Ephemeral,\" with her first Sequence Node \"Somewhere No One Travelled\" activated, sometimes ended prematurely.<br>- Fixed an issue where Resonator Camellya, after exiting Blossom Mode, could not perform Heavy Attack&mdash;by holding Basic Attack, after successfully dodging an attack.<br>- Fixed an issue where Resonators Camellya and Xiangli Yao sometimes appeared in abnormal locations upon casting their Intro Skills.<br>- Corrected textual errors in the description of Resonator Camellya's Cherished Item \"A Camellia.\"<br>- Fixed an issue where switching from Resonator Shorekeeper while in Unbound Form to another Resonator sometimes triggered multiple Plunging Attacks from the incoming Resonator.<br>- Fixed an issue where an enemy other than the targeted one was attacked when casting the Intro Skill of the Resonators \"Zhezhi,\" \"Xiangli Yao,\" \"Shorekeeper,\" \"Camellya,\" \"Youhu,\" or \"Lumi\" under certain circumstances.<br>- Fixed an issue where the \"DMG increased by 63%\" buff granted by Resonator Xiangli Yao's third Sequence Node \"\"Ruins of Ancient\"\" sometimes failed to take effect under certain circumstances.<br>- Fixed an issue where the casting of Resonator Jinhsi's Outro Skill sometimes failed to take effect in Co-op mode.<br>- Fixed an issue where the shadowing projection appeared defective on Mobile when certain skills of Resonator Jinhsi were cast.<br>- Fixed an issue where Resonator Jinhsi's character model behaved abnormally while in Incarnation.<br>- Fixed an issue where the \"Enemies Near\" voiceline was missing from the Information - Voice - Character Voicelines page for the Resonators \"Encore\" and \"Verina.\"<br>- Corrected textual errors on the Information - Backstory pages for the Resonators \"Encore\" and \"Yangyang.\"<br>- Fixed an issue where switching to another Resonator from the Resonators \"Chixia,\" \"Mortefi,\" or \"Aalto\" while they took aim to perform a Heavy Attack sometimes resulted in the character model not disappearing under certain circumstances.<br>- Fixed an issue where a Resonator sometimes performed continuous Basic Attacks after entering certain domains with Hoverdroid: Shooter equipped.<br>- Fixed an issue in Controller mode where Basic Attacks did not stop even after the player stopped pressing the Basic Attack button.</div>\n<div>Enemies &amp; Echoes<br>- Fixed an issue where the special effects for certain skills of Glacio Dreadmane appeared defective under certain circumstances.</div>\n<div>Features<br>- Fixed an issue in Co-op mode where one of the character models sometimes became immobile when switching between Resonators.<br>- Fixed an issue where the character model sometimes behaved abnormally while moving around upon exiting Co-op mode.<br>- Fixed an issue in Co-op mode where an enemy moved abnormally when attacked by 2P or 3P Rover.<br>- Fixed an issue where 2P or 3P Rover could not join Co-op mode.<br>- Fixed an issue where opening the Map through the touchpad of a DualSense&reg; or DualSense Edge&trade; controller sometimes failed to take effect.<br>- Fixed an issue where Trophy \"Point Zero\" and the Trophy series \"Defeat ~ with other players in Co-op Mode once\" (part of Trophies - Cross-Realm Ties) could not be obtained under certain circumstances.<br>- Fixed an issue where the Trophies \"Starry Hearts\" and \"Unboxing the Terminal\" could not be obtained under certain circumstances.<br>- Fixed an issue where the automatic exit countdown on the Results screen sped up under certain circumstances.<br>- Fixed an issue where certain Quest Items in the Backpack appeared more than once after completing a quest.<br>- Fixed an issue where the loading image was displayed incorrectly while entering the domain \"the End of Wandering.\"<br>- Fixed an issue where Waypoints could be activated while in elevators located in the Black Shores region.<br>- Fixed an issue where opening the Backpack sometimes caused the \"The above items have expired\" prompt to appear on the screen.</div>\n<div>&nbsp;</div>\n<div>Challenges, Puzzles &amp; Events<br>- Fixed an issue where the Area Effect \"Resonance Skill Cooldown Reduced by 5s\" was applied multiple times when certain Resonators cast their Resonance Liberations in Tower of Adversity - Overdrive Zone - Hazard Tower.<br>- Fixed an issue where the background music for Tactical Hologram: Ski challenges in certain locations of the Huanglong -Mt. Firmament area did not disappear after exiting the challenges.<br>- Fixed an issue in Pincer Maneuver Warriors where the special effects associated with the exit of the domain sometimes appeared defective.</div>\n<div>&nbsp;</div>\n<div>Quests<br>- Corrected textual errors in the Summary for Subtask \"Legacy of the Lasting Night\" of Main Quest \"To the Shore's End.\"<br>- Fixed an issue where certain special effects inside the Error Cell, located in the Tethys' Deep of the Black Shores, did not disappear after completing Main Quest \"To the Shore's End.\"<br>- Fixed an issue where NPC models overlapped each other in certain dialogue scenes of Companion Story \"Immortal Blaze.\"<br>- Fixed an issue where skill cooldowns sometimes failed to take effect while attacking Mourning Aix: Lamenting Shadow during Exploration Quest \"Stygian Lacrimosa.\"<br>- Fixed an issue where a gameplay guide for Tower of Adversity popped up when a Resonator came near the entrance to the Tower even if Tutorial Quest \"Alone in the Abyss\" had not been completed.</div>\n<div>&nbsp;</div>\n<div>Environment<br>- Fixed an issue where some NPC models in certain locations of the Black Shores exhibited abnormal behavior.<br>- Fixed an issue where a Resonator appeared floating in mid-air while seated on certain chairs or benches in the Huanglong - Central Plains area.<br>- Fixed an issue where a Resonator could enter the interior of a train in certain locations of the Huanglong - Whining Aix's Mire - Waving Battlefield area after restarting the game.<br>- Fixed an issue where a Resonator's footprints failed to appear in some locations when they were expected.<br>- Fixed an issue where some NPC models' movements appeared defective in certain scenes.<br>- Resolved known instances of objects floating in mid-air.</div>\n</div>",
  "articleCover": "",
  "articleId": 1912,
  "articleTitle": "Version 2.0: All Silent Souls Can Sing Patch Notes",
  "articleType": 58,
  "articleTypeName": "Notice",
  "contentCover": "",
  "gameId": "G152-en",
  "startTime": "2025-01-02 09:30:00"
}
