{
  "articleContent": "<div>\n<div><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://hw-media-cdn-mingchao.kurogame.com/object/1742918400000/wtgbqai6v0890mkj4v-1742998535116.jpg\" width=\"800\" data-media-source=\"production_G152_en\" data-desc=\"succ\"></div>\n<div>Dear Rover,<br>Thank you for your continued support. The following is a summary of content that will become available in Version 2.2: Tangled Truth in Inverted Tower.</div>\n<div>&nbsp;</div>\n<div><strong>[Maintenance Time &amp; Compensation Details]</strong><br><strong>✦Maintenance Time:<span style=\"color: rgb(224, 62, 45);\"> 2025-03-27 04:00 - 2025-03-27 11:00 (UTC+8)</span></strong><br><strong>✦Maintenance Compensation: Astrite x300, Crystal Solvent x2</strong><br><strong>✦Compensation Eligibility: Create a character and unlock the Mails feature before 2025-03-27 04:00 (UTC+8). The compensation can be claimed before the next version update.</strong><br>※In the event that the maintenance is extended, the dev team will issue a follow-up notice and adjust the compensation accordingly.</div>\n<div>&nbsp;</div>\n<div><strong>✦Bug Fixes Compensation: Astrite x300</strong><br><strong>✦Compensation Eligibility: Create a character and unlock the Mails feature before 2025-03-27 04:00 (UTC+8). The compensation can be claimed before the next version update.</strong></div>\n<div>&nbsp;</div>\n<div>&nbsp;</div>\n<div><strong>[Version Update Details]</strong><br><strong>✦New Resonators✦</strong><br><strong>5-Star Resonator: Cantarella (Havoc/Rectifier)</strong><br>The current head of Fisalia, Cantarella, the Bane.<br>A mysterious noblewoman, her beauty as captivating as it is perilous. She resides in a crown-like castle perched atop the mountain, where illusory dreams flow like streams, meticulously spun by her own hands.<br>●Combat Roles: Support and Healer, Concerto Efficiency, Basic Attack DMG, Coordinated Attack, Havoc DMG Amplification, Resonance Skill DMG Amplification<br>※Obtainable through the [Neptune's Lullaby] Featured Resonator Convene.</div>\n<div>&nbsp;</div>\n<div><strong>5-Star Resonator: Rover - Aero (Aero/Sword)</strong><br>Rover has gained a new attribute&mdash;Aero, along with all the associated abilities. This new attribute of Rover's is a well-balanced one. Rover: Aero deals Aero DMG to enemies and heals other Resonators with Eye of Tempest.<br>●Combat Roles: Support and Healer, Resonance Skill DMG, Aero Erosion<br>※Complete [Main Quest] Chapter II Act IV \"The Maiden, The Defier, The Death Crier\" to unlock.</div>\n<div>&nbsp;</div>\n<div><strong>✦New Weapons✦</strong><br><strong>5-Star Weapon: Whispers of Sirens (Rectifier)</strong><br>From the sea, some see stars, some catch the moon, and some hear countless whispers and murmurs.<br>Those murmurs seep into her venom, flowing through every winding river.<br>In the end, the murmurs envelope, like the bell of a jellyfish, like the sea.<br>※Obtainable through the [Absolute Pulsation - Whispers of Sirens] Featured Weapon Convene.</div>\n<div>&nbsp;</div>\n<div><strong>5-Star Weapon: Bloodpact's Pledge (Sword)</strong><br>This weapon is a testament to the unbreakable blood pact: One shall never betray, never surrender, and fight until the last drop of blood is shed.<br>※Complete [Main Quest] Chapter II Act IV \"The Maiden, The Defier, The Death Crier\" to obtain.</div>\n<div>&nbsp;</div>\n<div><strong>✦New Regions✦</strong><br><strong>Avinoleum</strong><br>Once a theological seminary of Rinascita, it now rests in the boundless expanse of clouds. It once recorded Rinascita's glory and grandeur, along with countless unspeakable secrets.<br>※Reach the location during [Main Quest] Chapter II Act IV \"The Maiden, The Defier, The Death Crier.\"</div>\n<div>&nbsp;</div>\n<div><strong>Beohr Waters</strong><br>Once a sacred land, only a faint shadow of Avinoleum's glory remains. Those destined to fall still live, while those meant to survive lie buried, transformed into divine oracles no one hears. Their lips remain sealed, and Their ears are bound by words They never spoke.<br>※Reach the location during [Main Quest] Chapter II Act IV \"The Maiden, The Defier, The Death Crier.\"</div>\n<div>&nbsp;</div>\n<div><strong>●[Avinoleum] New Way of Exploration</strong><br>[Gravity Calibrator] Gravity Adjustment<br>In Avinoleum, interact with Gravity Calibrators to change the direction of gravity in your surroundings and travel to more areas open to exploration.</div>\n<div>&nbsp;</div>\n<div>[Companion] Shared Adventure<br>For certain tasks in Avinoleum, you and the Companion Resonator can work together to complete them.</div>\n<div>&nbsp;</div>\n<div><strong>✦New Echoes✦</strong><br>Reminiscence: Fleurdelys, Capitaneus, La Guardia, Sagittario, Sacerdos, Glacio Drake, Electro Drake, Aero Drake, Nightmare: Lampylumen Myriad</div>\n<div>&nbsp;</div>\n<div>● New Sonata Set: Gusts of Welkin<br>Gusts of Welkin (2pcs Set): Aero DMG + 10%<br>Gusts of Welkin (5pcs Set): Inflicting Aero Erosion on enemies increases Aero DMG for all Resonators in the team by 15%, and for the Resonator triggering this effect by an additional 15%, lasting for 20s.</div>\n<div>&nbsp;</div>\n<div><strong>✦New Stories✦</strong><br><strong>[Main Quest] Chapter II Act IV \"The Maiden, The Defier, The Death Crier\"</strong><br>After the Carnevale, a voice in your head leads you to the supposed Martyred Maiden&mdash;Cartethyia. The encounter creates more questions than it answers.<br>Who are your enemies? Who are your friends? Where is the Inverted Tower located? The helper Carlotta has found and the invitation from Fisalia may help you answer all these questions. The moment of truth seems inevitable...<br>✦Duration: Permanently available after the Version 2.2 update.<br>✦Eligibility: Complete [Main Quest] Chapter II Act III \"What Yesterday Wept, Today Doth Sing.\"</div>\n<div>&nbsp;</div>\n<div><strong>[Cantarella's Companion Story] A Fleeting Night's Dream</strong><br>A mysterious letter gently lifts a corner of the veil that shrouds the nights gone by. A faint whisper from the depths of the abyss waits for your reply.<br>✦Duration: Permanently available after the Version 2.2 update.<br>✦Eligibility: Reach Union Level 20 and complete Main Quest Chapter II Act IV \"The Maiden, The Defier, The Death Crier.\"</div>\n<div>&nbsp;</div>\n<div><strong>[Exploration Quest] Should the Shooting Stars Blaze</strong><br>You find a mysterious \"light spark.\" Follow this little spark, and you may witness the shooting stars blaze.<br>✦Duration: Permanently available after the Version 2.2 update.<br>✦Eligibility: Complete [Main Quest] Chapter II Act IV \"The Maiden, The Defier, The Death Crier.\"</div>\n<div>&nbsp;</div>\n<div><strong>✦New Events &amp; Gameplay Features✦</strong><br><strong>●Special Events:</strong><br>[Avinoleum] Area Events<br>Participate in Area Exploration Event \"Winds of the Past\" to explore the area and win rewards.<br>Participate in Featured Exploration Event \"Avinoleum Travel Atlas\" to increase Exploration Progress for the new region and win Astrites and Premium Tuners.<br>Participate in Photo Collection Event \"Acropolis Documentarian\" to capture beautiful moments in Avinoleum.<br>✦Duration: Version 2.2 update - 2025-04-28 03:59 (server time)</div>\n<div>&nbsp;</div>\n<div><strong>[Virtual Crisis: Prototype Trials] Crisis Trial Challenge Event</strong><br>As a member of the Black Shores, take on Crisis Trial challenges and high-difficulty Disaster Trial challenges under various combinations of Stress Modules.<br>✦Duration: 2025-04-03 10:00 - 2025-04-28 03:59 (server time)</div>\n<div>&nbsp;</div>\n<div><strong>[If You Gaze Into the Abyss of Dreams] Featured Co-op Combat Event</strong><br>A girl called Dorothy appears next to a mysterious gate. She claims a sudden crisis is taking place inside.<br>✦Duration: 2025-04-17 10:00 - 2025-04-28 03:59 (server time)</div>\n<div>&nbsp;</div>\n<div><strong>[Lollo Campaign: Set Sail] Featured Commission Event</strong><br>Maji, your entrepreneurial friend, has made his way across the sea to Ragunna. It seems he's stumbled upon a golden opportunity, and he's eager to get you on board.<br>✦Duration: 2025-04-10 10:00 - 2025-04-24 03:59 (server time)</div>\n<div>&nbsp;</div>\n<div><strong>[Ragunna Weather Forecast] Featured Platforming Event</strong><br>KU-Ryan, a Black Shores robot, is currently looking for help in gathering Surveillance Datasets on Waveworn Phenomena in Ragunna.<br>✦Duration: 2025-04-10 10:00 - 2025-04-24 03:59 (server time)</div>\n<div>&nbsp;</div>\n<div><strong>[Wuthering Exploration] Featured Exploration Event: Whisperwind Haven</strong><br>Complete Survey Tasks daily to get Survey Points and claim rewards after meeting Survey Point requirements.<br>✦Duration: 2025-04-14 04:00 - 2025-04-28 03:59 (server time)</div>\n<div>&nbsp;</div>\n<div><strong>[Gifts of the Still Tides] 7-Day Login Event</strong><br>During the event, log in daily to claim the day's login rewards.<br>✦Rewards: Radiant Tide x5, Lustrous Tide x5<br>✦Duration: Version 2.2 update - 2025-04-28 03:59 (server time)</div>\n<div>&nbsp;</div>\n<div><strong>✦Other✦</strong><br>●[Tactical Hologram: Phantom Pain] Challenge: Dragon of Dirge<br>●[Titles]: Meet specific requirements to obtain honorary titles<br>●[Phantom Echo]: Phantom - Capitaneus<br>※Complete Exploration Quest \"Should the Shooting Stars Blaze\" to obtain Phantom: Capitaneus.</div>\n<div>&nbsp;</div>\n<div>&nbsp;</div>\n<div><strong>[Adjustments and Optimizations]</strong><br><strong>✦Resonators &amp; Weapons✦</strong><br>- Optimized the model performance for the back of Jinhsi's Outfit \"Peach Blossom.\"</div>\n<div>&nbsp;</div>\n<div><strong>✦Features✦</strong><br><strong>●Profile</strong><br><strong>New feature: Titles</strong><br>- View or change your Title via Terminal&gt; Profile &gt; Change Title<br>- Available Titles and their respective Unlock requirements are displayed on the Change Title page.<br>- Challenge Records before and after certain Titles are obtained will be displayed on the page. The Records will be updated if new ones are achieved.<br>- More Titles will be added in future versions.</div>\n<div>&nbsp;</div>\n<div><strong>●Story</strong><br><strong>New feature: Story Review</strong><br>- During a scene, press the icon in the top right corner of the screen to access Story Review.<br>- This feature allows you to replay previously voiced lines and view their subtitles.<br>- To access more storyline content, go to Terminal &gt; Gallery &gt; Main Story.</div>\n<div>&nbsp;</div>\n<div><strong>●Map</strong><br>- Added a \"Switch Gravity\" view option to the Map for Avinoleum.<br>- Added Switch Gravity-related Markers for Avinoleum.<br>- Added icons on the Map to show certain undiscovered gameplay content.&nbsp;<br>- Added the option to Track and Fast Travel to Collection Spots and locations marked with Lootmappers or Custom Markers. &nbsp;<br>- Adjusted the order of Regions displayed when \"Switch Map\" is pressed. Newer Regions will be displayed first.<br>Adjusted the rules under which certain red dots appear on the Map. A red dot will still appear if there are unclaimed rewards.</div>\n<div>&nbsp;</div>\n<div><strong>✦Leveling✦</strong><br><strong>●Materials for Leveling</strong><br>Added Quick Access to Supplies in Backpack:<br>- Select \"Supply Pack\" on the \"How to Get\" menu when leveling up to open Supply Packs which contain the required Material.<br>- If you have multiple Supply Packs that contain the required Material, the one with the lowest number of options will be opened first.</div>\n<div>&nbsp;</div>\n<div><strong>✦Challenges, Puzzles, &amp; Events✦</strong><br><strong>●Whimpering Wastes</strong><br>- Optimized the event page for Whimpering Wastes when the event is still locked.<br>- Adjusted the Environment Report effects in the current iteration of \"Respawning Waters: Torrents - Infinite Torrents.\"<br>- Adjusted the Bonuses granted by the Tokens \"The Revelry that Unveils Mysteries\" and \"The Blood Pact that Corrupts to the Core.\"<br>※Please note that the adjustments to Whimpering Wastes take effect after the maintenance update for Version 2.2 concludes.</div>\n<div>- Adjusted the gameplay tutorial text for Nightmare Cloud.</div>\n<div>&nbsp;</div>\n<div><strong>✦Controls✦</strong><br>- Added Controller vibration feedback when casting certain COST4 Echo Skills.<br>- Enhanced the visual contrast in Controller mode between selected and unselected content on certain pages.<br>- &nbsp;Added a button to the Activity screen that makes it easier to claim rewards when using a Controller.<br>- Optimized the experience when using Controller thumbsticks to move in-game sliders, reducing the likelihood of a slider bouncing back after being moved to the end of the slider.<br>- Optimized the Conversion process in Synthesis when using a Controller.</div>\n<div>&nbsp;</div>\n<div><strong>✦UI✦</strong><br>- Optimized the functionality of red dots on the Events page. Clicking red dots on the Events page now scrolls you to events with corresponding red dots.<br>- Adjusted the sizes of icons in the top left corner of the Map screen that provide access to various Exploration Progress-related tasks.</div>\n<div>&nbsp;</div>\n<div><strong>✦Graphics &amp; Performance✦</strong><br><strong>●Graphics Settings</strong><br><strong>Added Color Settings</strong><br>- Adjust the Color Settings via Settings &gt; Graphics &gt; Basic &gt; Color Settings<br>- The options \"Saturation\" and \"Contrast\" are now available, in addition to \"Brightness.\"<br>- Images are provided for reference to show the effects of different Settings.<br>※Please note that the Brightness value will be reset to the default 50 following the Version 2.2 update. If you set a Brightness value that is different from this default option, please readjust the value accordingly following the update.</div>\n<div>&nbsp;</div>\n<div><strong>Added notices regarding Frame Generation settings</strong><br>- If Hardware-Accelerated GPU Scheduling is not enabled on Windows, the \"Frame Generation\" option will be reset to \"Off\" following the Version 2.2 update. To turn on the Frame Generation option, enable the \"Hardware-Accelerated GPU Scheduling\" option via \"Settings &gt; System &gt; Display &gt; Graphics Settings\" on Windows and then reboot your PC.<br>- In the current version, the Frame Generation option is available for devices equipped with the NVIDIA RTX 40 series or later.</div>\n<div>&nbsp;</div>\n<div><strong>Added an On/Off option for Co-op Teammate VFX</strong><br>Turn this feature on or off via Settings &gt; Graphics &gt; Custom</div>\n<div>- Added physics effects to fabric, making fabric in certain scenes appear more realistic.<br>- Added the 120 FPS option for certain Mac models. This option is now available for Mac devices equipped with M3 Pro, M3 Max, M4, or M4 Pro processors.<br>- Optimized Ray Tracing in certain scenes.<br>- Optimized the efficiency of the shader compilation process and the hardware resource usage on PC.<br>- Optimized the visual effects for fog and cloud under certain settings on PC.</div>\n<div>&nbsp;</div>\n<div><strong>✦Other✦</strong><br><strong>●Title Screen</strong><br><strong>New feature: Network Test</strong><br>- If you encounter network-related issues, such as failure to log in, you now have the option of performing a network test via Tools &gt; Network Test on the title screen.<br>- The network testing process may take some time.<br>- If needed, you can report the network testing results and contact Customer Service to help us better identify the issue.</div>\n<div>- Optimized the log-in process and the process of entering or exiting the title screen, reducing the time required to log into and enter the game.<br>- Increased the number of Waypoints that can be deployed simultaneously to 10.<br>- Increased the number of Casket Sonar that can be deployed simultaneously to 5.<br>- Optimized the descriptions of certain in-game settings and functions.</div>\n<div>&nbsp;</div>\n<div>&nbsp;</div>\n<div><strong>[Bug Fixes]</strong><br><strong>●Resonators &amp; Weapons</strong><br>- Fixed an issue with enemy targeting when Resonator Brant performed Mid-air Attack 1.<br>- Fixed an issue where Resonator Brant might be downed without taking damage while performing Basic Attack 4.<br>- Fixed an issue with the effective DMG range of Resonator Brant's Resonance Skill \"Returned from Ashes.\"<br>- Fixed an issue with Resonator Brant's movements while casting Resonance Skill \"Returned from Ashes.\"<br>- Fixed an issue with some of Resonator Phoebe's Idle Animations in Camera mode.<br>- Fixed an issue where the Greeting voiceline was missing from Resonator Phoebe's \"Information - Voice\" page.<br>- Fixed an issue with the shadow of Resonator Phoebe's character model under certain circumstances.<br>- Fixed a clipping issue that affected Resonator Roccia's outfit when she made certain motions.<br>- Fixed an issue where the color at the edge of Resonator Carlotta's character model might appear abnormal under certain graphics settings.<br>- Fixed an issue where Resonator Carlotta's character model might behave abnormally when Substance was full.<br>- Fixed a clipping issue that affected Resonator Carlotta's outfit when she's climbing.<br>- Fixed an issue where Resonator Shorekeeper's Outro Skill failed to take effect correctly in Co-op mode.<br>- Fixed an issue where Inklit Spirits, triggered after Resonator Zhezhi casts Resonance Liberation \"Living Canvas,\" appeared abnormal under certain circumstances.<br>- Fixed an issue where after activating the fifth node of Resonator Jianxin's Resonance Chain \"Mirroring Introspection,\" the buff \"Damage from Purification Force Field is increased by 80%\" from the fourth node \"Multitide Reflection\" does not take effect when the Resonator casts Resonance Liberation.<br>- Fixed an issue where the coloring at the edge of Resonator Jianxin's character model might appear abnormal.<br>- Fixed an issue where the model for Unflickering Valor appeared abnormal when the weapon was equipped on certain Resonators.<br>- Fixed an issue where the of DoT from Spectro Frazzle Effect was abnormal under certain circumstances.</div>\n<div>&nbsp;</div>\n<div><strong>●Enemies &amp; Echoes</strong><br>- Fixed an issue where casting the Echo Skill \"Lorelei\" in mid-air caused Lorelei to continue falling while the transformation was still in effect.<br>- Fixed an issue where a Resonator could not perform Counterattack while using the Echo Skill \"Lorelei.\"<br>- Fixed an issue with the model for the Echo \"Phantom: Lorelei.\"<br>- Fixed an issue where casting Lumiscale Construct against an Enemy's Special Skill prevented Counter Skill from being triggered.<br>- Fixed an issue where certain buffs and debuffs did not take effect for a Resonator who transformed into a Carapace.<br>- Fixed an issue where during the fight with Dragon of Dirge, the enemy's movements might become abnormal after casting certain skills.<br>- Corrected the discrepancy between the actual DMG dealt by the Echo \"Hoochief\" and the associated description.</div>\n<div>&nbsp;</div>\n<div><strong>●Features</strong><br>- Fixed an issue where the Gallery - Sceneries screen flashed on certain mobile devices.<br>- Fixed an issue where defeating certain Tacet Discords detected via Echo Hunting did not direct the player to the tracking of a new Tacet Discord.<br>- Fixed an issue where using Grapple while floating in water might cause you to sink.<br>- Fixed an issue where clicking the \"zoom in to my current location\" icon in the bottom right corner of the \"Map - Switch Map\" screen did nothing in certain circumstances.<br>- Fixed an issue where zooming in and out of the Map caused certain Markers on the Mini Map to appear abnormal.<br>- Fixed an issue where some Rovers were not able to bring up the cursor after a black screen.<br>- Fixed an issue where friends added on the PS5 do not appear on the friend list after switching to PC.</div>\n<div>&nbsp;</div>\n<div><strong>●Challenges, Puzzles, &amp; Events</strong><br>- Fixed an issue in \"Old Man and the Whale\" where the special effects for \"Fast Travel to Dock\" might appear defective.<br>- Fixed an issue in \"Old Man and the Whale\" where some of the items displayed on the preview page for the event were incorrect.<br>- Fixed an issue where the Dock icon associated with \"Old Man and the Whale\" might appear on the main screen when not in the Riccioli Islands area.<br>- Fixed an issue in Tactical Hologram: Phantom Pain where multiple enemies could be summoned under certain circumstances.<br>- Fixed an issue in Whimpering Wastes with the attribute damage resistance of the enemies \"Violet-Feathered Heron\" and \"Rocksteady Guardian.\"<br>- Fixed an issue in Whimpering Wastes where dealing DMG to Cuddle Wuddle was impossible within a certain period after the enemy performed a Synergy attack.<br>- Fixed an issue in Whimpering Wastes where a new wave of enemies might appear and remain on the scene after the countdown ended.<br>- Fixed an issue in Whimpering Wastes where certain enemies had abnormal resistance to interruption.<br>- Corrected the discrepancy between the actual effects of Buffs and the associated descriptions for Riccioli Islands Tacet Field challenges.<br>- Fixed an issue where Dream Patrol that belongs to a different location was triggered in the \"Rinascita - Vault Underground\" area.<br>- Fixed an issue in \"Echo Challenge: Clear Cloud\" where transforming into Lottie Lost was impossible under certain circumstances.<br>- Fixed an issue in \"Echo Challenge: Unfinished Book\" where the text for the conversation with the NPC \"Fratellino\" contained errors.<br>- Fixed an issue in \"Echo Challenge: Plushie Punch\" where exiting the domain was impossible under certain circumstances.</div>\n<div>&nbsp;</div>\n<div><strong>●Controls</strong><br>- Fixed an issue where using a Controller made content on certain pages incomplete.<br>- Fixed an issue where the Echo Recommendation page could not be turned off if a Controller was used under certain Resolution settings.</div>\n<div>&nbsp;</div>\n<div><strong>●Graphics &amp; Performance</strong><br>- Fixed an issue where the models for certain Map areas and certain Resonators might appear blurry on PC.<br>- Fixed an issue where, with the Ray Tracing option turned on, the loading process might crash while trying to log in.<br>※To ensure a smooth performance, if your device has 16 GB of RAM, after turning Ray Tracing on, please restart the game once the shaders have finished compiling. We will make more optimizations in this regard in future versions.</div>\n<div>&nbsp;</div>\n<div><strong>●Quests</strong><br>- Fixed an issue in Companion Story \"Sail Day, Captain!\" where certain parts of the background music might be missing.<br>- Corrected textual errors in the outline of Side Quest \"Dream Patrol II.\"<br>- Fixed an issue in \"Amidst the Stars - Record the last location for KU-Cass\" where interaction could not be initiated at the task location, preventing quest progression.<br>- Fixed an issue in Side Quest \"Camp Raid\" where the NPCs might not appear, preventing quest progression.<br>- Fixed an issue in \"Cerulean Echoes Adrift in the Winds: Part I - Clear the corrupted data\" where the corrupted data might not appear at the task location, preventing quest progression.</div>\n<div>&nbsp;</div>\n<div><strong>●Environment</strong><br>- Fixed an issue where certain NPCs in the \"Rinascita - Riccioli Islands\" area floated in mid-air.<br>- Fixed an issue where certain NPCs in Rinascita have abnormal walking routes.<br>- Fixed an issue where certain NPC models in the Rinascita - Ragunna area behave abnormally.<br>- Fixed an issue where certain visual assets in the \"Rinascita - Nimbus Sanctum - Atrium of Reflections\" area appeared outside the bounds of the map.<br>- Fixed an issue where certain Gondolas in Rinascita might not appear.<br>- Fixed an issue with certain objection interactions in the \"End of Wandering\" domain.<br>- Resolved known issues regarding visual asset abnormalities.</div>\n</div>",
  "articleId": 2381,
  "articleTitle": "Version 2.2: Tangled Truth in Inverted Tower Patch Notes",
  "articleType": 58,
  "articleTypeName": "Notice",
  "endTime": "2099-01-01 00:00:00",
  "gameId": "G152-en",
  "startTime": "2025-03-27 10:00:00"
}
