{
  "articleContent": "<div>\n<p><span style=\"font-size: 14pt;\">Dear Rover,</span><br><br><span style=\"font-size: 14pt;\">To enhance your gameplay experience, we will be upgrading the Reprise of Tides Returnee Event in Version 2.3. As part of this update, the event will be temporarily unavailable for maintenance. Please take note of the scheduled maintenance time, and we appreciate your understanding for any inconvenience caused.</span><br><br><span style=\"font-size: 14pt;\">※For details about the improved Reprise of Tides Returnee Event, please refer to the upcoming official announcements.&nbsp;</span><br><br><span style=\"font-size: 14pt;\">✦Maintenance Schedule✦</span><br><span style=\"font-size: 14pt;\">2025-04-14 04:00 (server time) - Version 2.3 update</span><br><br><span style=\"font-size: 14pt;\">✦Requirements for Participation in Reprise of Tides✦</span><br><span style=\"font-size: 14pt;\">- You have reached Union Level 8.</span><br><span style=\"font-size: 14pt;\">- You have not logged in for at least 30 consecutive days.</span><br><span style=\"font-size: 14pt;\">- At least 30 days have passed since the end date of the last Reprise of Tides event that you participated in.</span><br><span style=\"font-size: 14pt;\">※Rovers who meet the above requirements can activate Reprise of Tides, which will last for 14 days upon activation.</span><br><br><span style=\"font-size: 14pt;\">✦Regarding the Accessibility of Reprise of Tides✦</span><br><span style=\"font-size: 14pt;\">●If you activate Reprise of Tides before maintenance starts, your access will remain unaffected.</span><br><span style=\"font-size: 14pt;\">●If you meet the returnee requirements during the maintenance period, you will temporarily be unable to assess the event until maintenance is over. Access will be granted to the updated Reprise of Tides Returnee Event once Version 2.3 goes live.</span><br><span style=\"font-size: 14pt;\">●If you meet the returnee requirements after maintenance, you will be able to access the updated Reprise of Tides Returnee Event.</span></p>\n</div>",
  "articleCover": "",
  "articleId": 2443,
  "articleTitle": "Notice on the Upgrade and Maintenance of the [Reprise of Tides] Returnee Event",
  "articleType": 58,
  "articleTypeName": "Notice",
  "contentCover": "",
  "gameId": "G152-en",
  "startTime": "2025-04-14 17:54:18"
}
