{
  "articleContent": "<div><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://hw-media-cdn-mingchao.kurogame.com/object/1747065600000/nqdnkrgjqfu17gtjx5-1747106616625.jpg\" width=\"800\" height=\"450\" data-media-source=\"production_G152_en\" data-desc=\"succ\"></div>\n<div>\n<p><span style=\"font-size: 14pt;\">The first Cube Games hosted by the Pioneer Association are officially up and running! Twelve Cube stars are set to showcase their skills on the track, setting aside their standings and identities, as they fully commit to compete for the title of fastest Cube!</span><br><span style=\"font-size: 14pt;\">For those who cannot participate in the race, no worries! We've got you covered! You can support potential winners through our official channels! Plus, the Pioneer Association will offer full live event coverage, and everyone is welcome to tune in and cheer for their favorite contestants!</span><br><span style=\"font-size: 14pt;\">(This program is brought to you by the Montelli Second Coming of Solaris Branch, in partnership with the New Black Shores.)</span><br><br><span style=\"font-size: 14pt;\">✦Duration✦</span><br><span style=\"font-size: 14pt;\">2025-05-14 08:00 - 2025-05-26 03:59 (server time)</span><br><br><span style=\"font-size: 14pt;\">※From 2025-05-14 08:00 to 2025-05-23 19:30 (server time), you can support your favorite Cube every day. From 2025-05-23 19:30 to 2025-05-26 03:59 (server time), support will be closed. During this period, you can view race results, check the leaderboard, watch replays, and claim event rewards.</span><br><br><span style=\"font-size: 14pt;\">✦Rewards✦</span><br><span style=\"font-size: 14pt;\">Astrite x300, Shell Credit x116500</span><br><br><span style=\"font-size: 14pt;\">✦Eligibility✦</span><br><span style=\"font-size: 14pt;\">Reach Union Level 8.</span><br><br><span style=\"font-size: 14pt;\">✦Event Details✦</span><br><span style=\"font-size: 14pt;\">- During the event, 12 Cubes will take part in elimination rounds in 2 Groups, with 1 round taking place per day and 10 rounds in total to decide the Ultimate Race Winner.</span><br><span style=\"font-size: 14pt;\">- From 08:00 to 19:30 (server time), you can support your favorite Cube by predicting the Round Winner of the day.</span><br><span style=\"font-size: 14pt;\">Each round starts at 20:00 (server time). From the event page, you can view the race live broadcast and cheer for your favorite Cube in the live chat. After the round, Popularity rewards are granted based on the Cubes' final placements and the prediction outcomes.</span><br><span style=\"font-size: 14pt;\">- Go to the event page to check out the schedule and videos of finished races.</span><br><span style=\"font-size: 14pt;\">- Support Cubes and confirm results to increase your Popularity. When your Popularity meets the requirements, you will be granted Popularity Rewards.</span><br><span style=\"font-size: 14pt;\">- If there are any unclaimed rewards after the event ends, they will be automatically sent to your inbox when you log in again within 30 days.</span></p>\n</div>",
  "articleCover": "",
  "articleId": 2602,
  "articleTitle": "[Cubie Derby] Anniversary Spectator Event",
  "articleType": 58,
  "articleTypeName": "Notice",
  "contentCover": "",
  "gameId": "G152-en",
  "startTime": "2025-05-13 11:00:00",
  "articleDesc": "",
  "createTime": "2025-05-13 11:23:58",
  "suggestCover": "",
  "top": 0
}