{
  "articleContent": "<div>\n<div data-page-id=\"A7ZVdwT6ToBYfyxclFhcMAXGnbd\" data-lark-html-role=\"root\" data-docx-has-block-data=\"false\">\n<div style=\"text-align: left;\">Wuthering Waves has once again partnered with Twitch to present the Wuthering Waves x Twitch: Support a streamer. Starting from June 12, 03:00 to June 18, 03:00 (PT), Twitch viewers will receive the \"Clear Day\" Gift Pack for gifting or buying 2 different tiers of Twitch subscriptions (Prime Subs are excluded) to any streamers within the Wuthering Waves category. The gift pack includes: Flight Aspect \"Clear Day,\" Advanced Revival Inhaler x1, and Advanced Nutrient Block x1.</div>\n<div style=\"text-align: left;\">&nbsp;<img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://hw-media-cdn-mingchao.kurogame.com/object/1749657600000/glktz873ajxr2fc9e1-1749720852373.jpg\" width=\"800\" height=\"450\" data-media-source=\"production_G152_en\" data-desc=\"succ\"></div>\n<div style=\"text-align: left;\">&nbsp;</div>\n<div style=\"text-align: left;\">&nbsp;</div>\n<div style=\"text-align: left;\">\n<div data-page-id=\"A7ZVdwT6ToBYfyxclFhcMAXGnbd\" data-lark-html-role=\"root\" data-docx-has-block-data=\"false\">\n<div><strong>How to Participate</strong></div>\n<div>Step 1: Log in with your Twitch account</div>\n<div>Step 2: Watch any livestream channel being conducted under the Wuthering Waves category on Twitch within the event duration</div>\n<div>Step 3: Purchase or give away two different tiers of subscription on the above channel</div>\n<div>&nbsp;</div>\n<div><strong>SUPPORT A STREAMER Q&amp;A</strong></div>\n<div>Q: In which regions will the Support a streamer event be available?</div>\n<div>A: Players from all regions where both Wuthering Waves and Twitch provide services are eligible to participate in this event.</div>\n<div>&nbsp;</div>\n<div>Q: How to confirm which channels meet the conditions of this campaign?</div>\n<div>A: During the event, search for \"Wuthering Waves\" on Twitch and enter the \"Wuthering Waves\" category to locate the Twitch channel that is currently livestreaming under the Wuthering Waves category.</div>\n<div>&nbsp;</div>\n<div>Q: How do I purchase a subscription on Twitch?</div>\n<div>A: Users must first log into Twitch, using either a web browser or a mobile device. Purchases may be made on either a web browser or a mobile device. Detailed information on purchasing subscriptions can be found <a href=\"https://help.twitch.tv/s/article/purchase-support-faq?language=en_US#Purchases\" data-lark-is-custom=\"true\">here</a>, and information on purchasing gift subscriptions can be found <a href=\"https://help.twitch.tv/s/article/gift-subscriptions?language=en_US\" data-lark-is-custom=\"true\">here</a>. If you have any other questions when completing your subscription purchase, please click <a href=\"https://help.twitch.tv/s/contactsupport?language=en_US&amp;selectedCategory=Purchases&amp;selectedSubCategory=Subscriptions&amp;selectedDetailCategory=Subscription%20gifting%20issues\" data-lark-is-custom=\"true\">here</a> to contact the Twitch customer service team for support.</div>\n<div>&nbsp;</div>\n<div>Q: Why have I not received rewards after subscribing to a streamer?</div>\n<div>A: The campaign commences on June 12, 03:00, and concludes on June 18, 03:00 (PT). Subscriptions made before this period will not be eligible for rewards. Similarly, subscriptions made while the channel is not actively streaming Wuthering Waves under the designated category will not count towards the campaign. If you are unsure if your subscription was successful, please click <a href=\"https://www.twitch.tv/wallet?tab=purchase-history\" data-lark-is-custom=\"true\">here</a> to confirm your purchase.</div>\n<div>&nbsp;</div>\n<div>Q: Where can I locate my campaign rewards once earned?</div>\n<div>A: Upon earning rewards, the campaign redemption code will be dispatched to the user's Twitch notification inbox within 24 hours. This inbox can be accessed via the top navigation bar on Twitch, situated to the right. The received codes will persist until manually deleted by the user. In addition, the redemption code can also be found on your Drops &amp; Rewards Inventory page. If you still haven't received the redemption code 24 hours after successfully earning the reward, please click <a href=\"https://help.twitch.tv/s/contactsupport?language=en_US&amp;selectedCategory=Purchases&amp;selectedSubCategory=Subscriptions&amp;selectedDetailCategory=Subscription%20gifting%20issues\" data-lark-is-custom=\"true\">here</a> to contact the Twitch customer service team for support.</div>\n<div>&nbsp;</div>\n<div>Q: After receiving the rewards, how do I redeem them in the game?</div>\n<div>A: Please follow these steps to claim your rewards:</div>\n<ol start=\"1\">\n<li data-list=\"number\">\n<div>Select your server and enter the game, and then go to [Settings] - [Other] - [Redemption Code].</div>\n</li>\n<li data-list=\"number\">\n<div>Enter the [Redemption Code] and hit [Confirm] to redeem rewards.</div>\n</li>\n<li data-list=\"number\">\n<div>You can then claim them in your in-game mail.</div>\n</li>\n<li data-list=\"number\">\n<div>The [Redemption Code] function will be unlocked once you've reached Union Level 2.</div>\n</li>\n</ol>\n<div>*The Redemption Code obtained in this event will expire on 2025-08-17 09:00 (PT). Redemption Codes that expire will be unable to be redeemed.</div>\n<div>&nbsp;</div>\n<div>*Should you encounter any issues, please contact Customer Service via the following email address:</div>\n<div>wutheringwaves_ensupport@kurogames.com</div>\n</div>\n</div>\n</div>\n</div>",
  "articleCover": "",
  "articleId": 2753,
  "articleTitle": "Wuthering Waves x Twitch: Support a Streamer is now underway!",
  "articleType": 58,
  "articleTypeName": "Notice",
  "contentCover": "",
  "gameId": "G152-en",
  "startTime": "2025-06-12 18:30:00",
  "articleDesc": "",
  "createTime": "2025-06-09 21:57:17",
  "suggestCover": "",
  "top": 0
}