{
  "articleContent": "<div><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://hw-media-cdn-mingchao.kurogame.com/object/1750176000000/qpg3znnft2ghkowxwh-1750214997294.jpg\" width=\"800\" height=\"450\" data-media-source=\"production_G152_en\" data-desc=\"succ\"></div>\n<p><span style=\"font-size: 14pt;\">Tethys's crisis simulation program is getting an upgrade. With newly gathered data from the Black Shores and Rinascita, even harsher scenarios now await those who dare to face the challenge&hellip;</span><br><span style=\"font-size: 14pt;\">&nbsp;</span><br><span style=\"font-size: 14pt;\">✦Duration✦</span><br><span style=\"font-size: 14pt;\">2025-06-19 10:00 - 2025-07-23 03:59 (server time)</span><br><span style=\"font-size: 14pt;\">&nbsp;</span><br><span style=\"font-size: 14pt;\">✦Rewards✦</span><br><span style=\"font-size: 14pt;\">Astrite x500, Virtual Vanquisher (Title) x1, Premium Tuner x200, Advanced Resonance Potion x25, Advanced Sealed Tube x20, Shell Credit x500000, and other Materials.</span><br><span style=\"font-size: 14pt;\">&nbsp;</span><br><span style=\"font-size: 14pt;\">✦Eligibility✦</span><br><span style=\"font-size: 14pt;\">Reach Union Level 30.</span><br><span style=\"font-size: 14pt;\">&nbsp;</span><br><span style=\"font-size: 14pt;\">✦Event Rules✦</span><br><span style=\"font-size: 14pt;\">- As a member of the Black Shores, take on Crisis Trial challenges and Disaster Trial high-difficulty challenges under various combinations of Stress Modules.</span><br><span style=\"font-size: 14pt;\">- In Crisis Trials, select a Stress Level for each trial. The Stress Level must meet the requirements to complete the trial. Each trial has a default Stress Module. Support Modules are available to lower the trial's difficulty. After completing a Crisis Trial, the corresponding Disaster Trial along with its Stress Module and Support Module will be unlocked.</span><br><span style=\"font-size: 14pt;\">- Disaster Trials have no required Stress Level. Participating in a Disaster Trial will consume Support Modules, so select them carefully in advance.</span><br><span style=\"font-size: 14pt;\">- Obtain Matrix Crystals by achieving Challenge Objectives in the Crisis and Disaster Trials. Matrix Crystals can be exchanged for rewards at the Supply Station. The Supply Station closes when this event ends. Please exchange your Matrix Crystals in time.</span><br><span style=\"font-size: 14pt;\">- Completing certain Stress Level challenges in Disaster Trials will grant an event-exclusive Title \"\"Virtual Vanquisher.\"\"</span><br><span style=\"font-size: 14pt;\">&nbsp;</span><br><span style=\"font-size: 14pt;\">※Certain high-difficulty Stress Modules can only be unlocked after clearing a Disaster Trial. Warning: Equipping too many Stress Modules may make the trial excessively challenging.</span><br><span style=\"font-size: 14pt;\">※If a participant is downed in a trial, they can consume Stress Levels to revive. This also gives a corresponding buff. Please note that consuming Stress Levels will affect the completion and final result of Challenge Goals.</span></p>",
  "articleCover": "",
  "articleId": 2826,
  "articleTitle": "[Virtual Crisis: Frontier Trials] Crisis Trial Challenge Event",
  "articleType": 58,
  "articleTypeName": "Notice",
  "contentCover": "",
  "gameId": "G152-en",
  "startTime": "2025-06-18 10:00:00",
  "articleDesc": "",
  "createTime": "2025-06-18 10:50:17",
  "suggestCover": "",
  "top": 0
}