{
  "articleContent": "<div><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://hw-media-cdn-mingchao.kurogame.com/object/1760025600000/m96vgfxjjtjd3hklc0-1760076855378.jpg\" width=\"800\" height=\"450\" data-media-source=\"production_G152_en\" data-desc=\"succ\">\n<p><span style=\"font-size: 14pt;\">To help prevent another Waveworn Phenomenon on the scale of a Dark Tide, the Black Shores and Rinascita have come together on a joint project: to conduct simulations using a hologram device in regions vulnerable to the Threnodian's power. Thus, you and your reliable companions have been invited to help test this unique device.</span><br><br><span style=\"font-size: 14pt;\">✦Duration✦</span><br><span style=\"font-size: 14pt;\">2025-10-11 10:00 - 2025-11-19 03:59 (server time)</span><br><br><span style=\"font-size: 14pt;\">✦Rewards✦</span><br><span style=\"font-size: 14pt;\">Astrite x800, \"\"Lighthouse and Blake Bloom\"\" Medal x1 (Sigil), Lighthouse and Blake Bloom x1 (Avatar), Modifier x6, Premium Tuner x100, Forgery Premium Supply x9, Premium Enclosure Tank x12, Shell Credit x380000, and other Materials.</span><br><br><span style=\"font-size: 14pt;\">✦Eligibility✦</span><br><span style=\"font-size: 14pt;\">Reach Union Level 14 and unlock the Resonance Nexus in Ragunna City during Main Quest \"\"The Sacred Breeze So Often Breathes.\"\"</span><br><br><span style=\"font-size: 14pt;\">✦Event Details✦</span><br><span style=\"font-size: 14pt;\">- Choose a participating Resonator and dive into simulated combat drills! Under a special tactical view, you'll direct them as they fend off waves of enemies with brand-new weapons. As you battle, spend the Enhancement Modules gained to power up your Resonator or improve their weapons. To clear a drill, you must survive every wave of attack.</span><br><span style=\"font-size: 14pt;\">- Clearing a combat drill for the first time grants you Enhancement Modules, which can be used to unlock various buffs on the Talents page.</span><br><span style=\"font-size: 14pt;\">- Complete Milestone Tasks and Achievement Tasks in combat drills to obtain Simulation Data. When the total Simulation Data point meets the requirement, you will receive the event-exclusive rewards: \"\"Lighthouse and Blake Bloom\"\" Medal (Sigil), Lighthouse and Blake Bloom (Avatar).</span><br><span style=\"font-size: 14pt;\">- Any unclaimed rewards will be sent via Mail the next time you log in within 30 days after the event ends.</span></p>\n</div>",
  "articleCover": "",
  "articleId": 3431,
  "articleTitle": "[Lament Recon: Solaris Soldier] Combat Event",
  "articleType": 58,
  "articleTypeName": "Notice",
  "contentCover": "",
  "gameId": "G152-en",
  "startTime": "2025-10-10 11:00:00",
  "articleDesc": "",
  "createTime": "2025-10-10 14:14:34",
  "suggestCover": "",
  "top": 0
}