{
  "articleContent": "<div><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://hw-media-cdn-mingchao.kurogame.com/object/1764086400000/ldt3k8vm9hq09qzl7v-1764152839874.jpg\" width=\"800\" height=\"450\" data-media-source=\"production_G152_en\" data-desc=\"succ\">\n<p><span style=\"font-size: 14pt;\">As the Tactical Simulacra project advances, the Huaxu Academy has successfully achieved the measurement of Tunability, a property through which countless Reverberations converge into Tacet Discords. Disrupting their Tunability would mean a lethal blow that paralyzes them...</span><br><br><span style=\"font-size: 14pt;\">✦Duration✦</span><br><span style=\"font-size: 14pt;\">2025-11-27 04:00 - 2025-12-15 03:59 (server time)</span><br><br><span style=\"font-size: 14pt;\">✦Rewards✦</span><br><span style=\"font-size: 14pt;\">Astrite x600, Premium Resonance Potion x16, Premium Energy Core x16, Premium Sealed Tube x16, Premium Tuner x100, Shell Credit x608888, and other Materials.</span><br><br><span style=\"font-size: 14pt;\">✦Eligibility✦</span><br><span style=\"font-size: 14pt;\">Reach Union Level 14.</span><br><br><span style=\"font-size: 14pt;\">✦Event Rules✦</span><br><span style=\"font-size: 14pt;\">- In Tactical Simulacra: Off Tune, challenge waves of powerful enemies using special buffs across different simulation domains.</span><br><span style=\"font-size: 14pt;\">- Tactical Simulacra: Off Tune has a total of 6 stages. Reach 1000 points in a stage to unlock the next one.</span><br><span style=\"font-size: 14pt;\">- As you complete more challenges, new special buffs will be available to you in the subsequent challenges.</span><br><span style=\"font-size: 14pt;\">- The results of each challenge will be tallied based on Monster Points, Time Points, and Technical Points. Monster Points are earned by defeating enemies in challenges; Time Points are earned based on the time remaining at challenge completion and a conversation factor that increases with the number of enemies that are defeated; Technical Points are earned by triggering Counterattacks, successful Dodges, and Dodge Counters.</span><br><br><span style=\"font-size: 14pt;\">※In Tactical Simulacra: Off Tune, some of your attacks build up certain enemies' Off-Tune Level. Once their Off-Tune Level reaches the limit, they enter the Mistune state. During this state, you can unleash a powerful Tune Break to shatter their defenses. Landing a Tune Break resets the enemies' Off-Tune Level and inflicts Tune Disruption, leaving them vulnerable to follow-up attacks.</span></p>\n</div>",
  "articleCover": "",
  "articleId": 3672,
  "articleTitle": "[Tactical Simulacra: Off Tune] Featured Combat Event",
  "articleType": 58,
  "articleTypeName": "Notice",
  "contentCover": "",
  "gameId": "G152-en",
  "startTime": "2025-11-26 10:00:00",
  "articleDesc": "",
  "createTime": "2025-11-26 18:27:39",
  "suggestCover": "",
  "top": 0
}