{
  "articleContent": "<div data-page-id=\"Ogt1d8dA8ou6yCx5SO4cZef7nKd\" data-lark-html-role=\"root\" data-docx-has-block-data=\"false\">\n<div><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://hw-media-cdn-mingchao.kurogame.com/object/1766678400000/hzzi0vb6nknb7nz2yj-1766718595835.jpg\" width=\"800\" height=\"450\" data-media-source=\"production_G152_en\" data-desc=\"succ\">Dear Rover,</div>\n<div>V3.0 WUWA Discord Quest Livestream Event has begun. Click the link below to complete the streaming quest on Discord and get a chance to win rewards including Morphable Echo!</div>\n<div>\n<div data-zone-id=\"0\" data-line-index=\"0\" data-line=\"true\"><a href=\"https://discord.com/quests/1448749066774380766\" target=\"_blank\" rel=\"noopener noreferrer\">https://discord.com/quests/1448749066774380766</a></div>\n</div>\n<br>\n<div>&nbsp;</div>\n<div>&nbsp;</div>\n<h2>Event Duration</h2>\n<div>\n<div>\n<div data-zone-id=\"0\" data-line-index=\"0\" data-line=\"true\">2025/12/26 ~ 2025/12/31 17:00 (PT)</div>\n</div>\n</div>\n<div>&nbsp;</div>\n<h2>Rewards</h2>\n<div>Shell Credit*20,000</div>\n<div>Advanced Resonance Potion*3</div>\n<div>Advanced Energy Core*3</div>\n<div>Astrite*30</div>\n<div>&nbsp;</div>\n<div><strong>Please</strong><strong> note that the rewards are limited to 300,000 in total and will be given out on a first-come, first-served basis, determined by the time the Redemption Code is claimed after completing the streaming quest. </strong><strong>The Redemption Code will expire at 2026/02/05 at 15:59 (PT). The reward will be limited to one reward redemption per account.</strong></div>\n<div>&nbsp;</div>\n<h2>Who is Eligible</h2>\n<div>Available to players on PC where both Discord and Wuthering Waves are available. Discord&rsquo;s premium services are restricted in some regions.</div>\n<div>&nbsp;</div>\n<h2><strong>Other Terms</strong></h2>\n<div>Limit of one reward redemption per account. For more information on Discord Quests, please visit <a href=\"https://support.discord.com/hc/articles/22225719947543\" data-lark-is-custom=\"true\">Discord Quest Help Center</a>.</div>\n<div>&nbsp;</div>\n<h2>How to Participate</h2>\n<div>In order to successfully complete the <strong>V3.0 WUWA Discord Quest</strong>, players who meet the eligibility criteria must live stream their <strong>Wuthering Waves </strong>gameplay to a friend via a Discord voice channel for a minimum duration of 15 minutes on the desktop app.</div>\n<div>&nbsp;</div>\n<div>1. Before you can begin the Quest, launch the game.</div>\n<div>&nbsp;</div>\n<div>2. Then, head to your Discord desktop app and navigate to a direct message (DM), group chat, or a server of your choice.</div>\n<div>&nbsp;</div>\n<div>3. Once there, start a voice call or join a voice channel and select the <strong>Screen</strong> <strong>Share</strong> icon located in the voice status panel. Be sure to select the individual application for the game before you Go Live.</div>\n<div>*NOTE: You must select the game application to stream! Streaming your device&rsquo;s screen will not progress your Quest forward. Once you stream, you can check the progress bar on the Quest Home to ensure progress is being made on the Quest.</div>\n<div>4. When you&rsquo;re ready to stream your gameplay, press <strong>Go Live. </strong>You can learn more about streaming your game <span style=\"color: rgb(36,91,219);\"><a href=\"https://support.discord.com/hc/en-us/articles/360040816151-Go-Live-and-Screen-Share#h_01HFFJ28PJAY9AHGRQ85XRSF8G\" data-lark-is-custom=\"true\">here</a></span>.</div>\n<div>&nbsp;</div>\n<h2>Redemption Instructions</h2>\n<div>1. Once you have completed the Quest by streaming 15 minutes of Wuthering Waves, you will receive a reward code in Quest Home (Discovery &gt; Quests). For detailed instructions on how to claim your reward code, please refer to our <a href=\"https://support.discord.com/hc/articles/22225719947543-Discord-Quests-FAQ#h_01HVPBZR5FKKSQ3R1JXB9E4DM3\" data-lark-is-custom=\"true\">Discord Quests FAQ</a>.</div>\n<div>2. Select your server and enter Wuthering Waves, and then go to [Settings] - [Other] - [Redemption Code].</div>\n<div>3. Enter the [Redemption Code] and hit [Confirm] to redeem rewards. You can then claim them in your in-game mail.</div>\n<div>4. The [Redemption Code] function will be unlocked once you've reached Union Level 2.</div>\n<div>5. The Redemption Code obtained in this event will expire on 2026/02/05 at 15:59 (PT). Redemption Codes that expire will be unable to be redeemed.</div>\n<div>&nbsp;</div>\n<h2>Discord Quest FAQ</h2>\n<div><strong>Q: Is there a limit on how many Quests I can redeem on my Discord account?</strong></div>\n<div>A: Eligible users can redeem one of each of the available Quest campaigns on their Discord account.</div>\n<div>For more information on Discord Quests, visit our <a href=\"https://support.discord.com/hc/articles/22225719947543\" data-lark-is-custom=\"true\">Discord Quest Help Center</a>.</div>\n<div><strong>Q: Is this feature/promotion available in my region?</strong></div>\n<div>A: Some Quests will not be available in all regions based on terms and conditions. If you are in an ineligible region for a Quest, you will not be able to complete it.</div>\n<div>Additionally, Discord&rsquo;s premium services are restricted in some regions. If you are unable to access the Gift Inventory, you are not eligible for Quests.</div>\n<div><strong>Q: I have concerns or questions regarding privacy and Quests. </strong></div>\n<div>A: We encourage you to review <a href=\"https://discord.com/privacy\" data-lark-is-custom=\"true\">Discord&rsquo;s Privacy Policy</a> for further details about how we use your information. You can head over to our <a href=\"https://support.discord.com/hc/en-us/articles/22225542459415\" data-lark-is-custom=\"true\">Data Used for In-Game Rewards</a> article, to learn more about how we use data for Quests.</div>\n<div><strong>Q: Why am I unable to complete Quest while using Linux?</strong></div>\n<div>A: Currently, Quest rewards are unable to be earned on Linux devices.</div>\n<div>However, Discord team is looking into a resolution for this issue so that earning Quest rewards is possible on Linux in the future. For now, we recommend completing the requirement on a different operating system, like Windows or MacOS.</div>\n<div>Discord support team does not have an exact ETA for when a solution will be available, and won't be able to provide any status updates on this specific issue.</div>\n<div><strong>Q: I no longer see a Quest. Where did it go?</strong></div>\n<div>A: Quests are typically only available for a limited amount of time. If you no longer see a Quest in the Quest Home or in-app notifications about the quest, the period to complete and claim the reward for the Quest is over.</div>\n</div>",
  "articleId": 3936,
  "articleTitle": "V3.0 WUWA Discord Quest Livestream Event Begins!",
  "articleType": 58,
  "articleTypeName": "Notice",
  "endTime": "2099-01-01 00:00:00",
  "gameId": "G152-en",
  "startTime": "2025-12-26 14:00:00",
  "articleDesc": "",
  "createTime": "2025-12-26 11:10:52",
  "suggestCover": "",
  "top": 0
}