{
  "articleContent": "<div>\n<p><span style=\"color: #e03e2d;\"><strong><span style=\"font-size: 14pt;\">Sanhua's Backstory</span></strong></span><br /><br /><span style=\"font-size: 14pt;\">Sanhua is a Resonator who rarely lets her emotions show. You can sense a certain distance when you first meet her. Sanhua is also careful not to burden others with her actions. Perhaps, her personality stems from her tragic past.</span></p>\n<p><span style=\"font-size: 14pt;\">Sanhua's tragedy started with a heavy snowfall. A sudden emergence of the Waveworn Phenomenon consumed the town where she resided. Sanhua was the sole survivor of this devastating catastrophe. While she managed to escape the clutches of the Tacet Discords, her right eye was injured. Sanhua was born blind, but the erosion of Waveworn Phenomenon gave her terrifying and anomalous vision.</span></p>\n<p><span style=\"font-size: 14pt;\">In addition to her anomalous vision, this catastrophe also granted her a powerful Forte of ice manipulation. In her youth, Sanhua struggled to keep her Forte under control. Her body always emitted an unconscious, chilling coldness that repelled those around her.</span></p>\n<p><span style=\"font-size: 14pt;\">Her life changed when she met Jinxi &mdash; the first person who appeared normal and untwisted in Sanhua's eyes. Jinxi gave her hope that destruction could also bring a new birth. As a result, Sanhua wholeheartedly pledged her loyalty to Jinxi,&nbsp; and she has been tirelessly working towards creating the future they both dream of.</span></p>\n<p><span style=\"font-size: 14pt;\">With the arrival of you, the Rover, Sanhua's world is poised for new and transformative changes: In her eyes, your frequency resonates with the same beauty and clarity that she once saw in Jinxi.</span><br /><br /><br /><span style=\"color: #e03e2d;\"><strong><span style=\"font-size: 14pt;\">An All-round Guard</span></strong></span><br /><br /><span style=\"font-size: 14pt;\">As Jinxi's guard, there's no doubt that Sanhua demonstrates exceptional physical prowess. In fact, she's capable of a lot more than that &mdash; Sanhua has a vast reserve of knowledge that enables her to respond fluently to any query. Her outstanding ability to remain composed enables her to handle emergencies flexibly. Furthermore, she boasts excellent cooking skills on par with a seasoned chef, and her adeptness in negotiations paves the way for successful deals.</span></p>\n<p><span style=\"font-size: 14pt;\">Sanhua's capabilities extend beyond guarding&mdash; she's a proficient secretary as well. For example, she can finish all the paperwork for the next three months in a couple of days, and Jinxi would joke how Sanhua left her \"nothing to do\"; she can also deliver all three meals to Jinxi's doorway quietly, without ever being noticed... These tasks constitute her daily routine.</span></p>\n<p><span style=\"font-size: 14pt;\">It's important to note that Sanhua wasn't inherently an all-rounder. Her versatility is a testament to her remarkable fast-learning ability. If she believes that a skill will help Jinxi, she is going to master it quickly without hesitation.</span><br /><br /><br /><span style=\"color: #e03e2d;\"><strong><span style=\"font-size: 14pt;\">A Walking Ice Machine</span></strong></span><br /><br /><span style=\"font-size: 14pt;\">Although Sanhua has fully mastered her Forte now, the changes in her mood continue to influence the temperature around her.</span></p>\n<p><span style=\"font-size: 14pt;\">When Sanhua senses a lurking danger or unfriendly situation, delicate snowflakes materialize around her, serving as a clear sign that she is becoming defensive. Sometimes, these snowflakes appear not only in response to danger but also when she feels embarrassed or anxious. It is difficult for others to discern the exact trigger behind the emergence of these snowflakes, as Sanhua maintains a poker face.</span><br /><br /><br /><span style=\"color: #e03e2d;\"><strong><span style=\"font-size: 14pt;\">R&amp;D Master of Loong Buns</span></strong></span><br /><br /><span style=\"font-size: 14pt;\">Sanhua has a deep passion for improving her cooking abilities, especially when it comes to making Loong Buns. She is particularly motivated because Jinxi loves Loong Buns so much. Sanhua enjoys experimenting with various fillings to create different types of Loong Buns, just to listen to Jinxi's happy sigh as she savors the delicious treats. Now, Sanhua has a new \"customer\", and that's the Rover. Sanhua aims to share the delightful taste of her Loong Buns with you. Therefore, her dedication to honing her cooking skills is stronger than ever.</span><br /><br /><br /><span style=\"color: #e03e2d;\"><strong><span style=\"font-size: 14pt;\">A Hidden Side Revealed by Flower Beverage</span></strong></span><br /><br /><span style=\"font-size: 14pt;\">Sanhua enjoys a unique beverage made from flower petals. However, she doesn't consume it regularly because she knows it can affect her work. When she drinks it, she becomes more lively and uninhibited. Although she appears normal on the outside, she speaks openly and reacts more slowly. She even resists taking breaks and can remain in this dreamy state for an entire day.</span><br /><br /><br /><span style=\"color: #e03e2d;\"><strong><span style=\"font-size: 14pt;\">Sanhua's Appearance</span></strong></span><br /><br /><span style=\"font-size: 14pt;\">Sanhua's tragic past and her role as a guard naturally paint her as low-key and distant. This led us to choose black as the dominant color to accentuate this aspect.</span></p>\n<p><span style=\"font-size: 14pt;\">For her clothing style, we harmonized classical and contemporary elements. We chose a pure black beret for Sanhua, as it ensures that her silver hair doesn't attract excessive attention while aligning seamlessly with her attire. This fashion item brings out a cool and neat image of Sanhua.</span></p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1693843200000/a313ud321if94srowv-1693896585180.jpg\" alt=\"\" width=\"800\" height=\"800\" /><br /><span style=\"font-size: 14pt;\">When it comes to Sanhua's clothing and decorations, we incorporated a lot of \"Wave Patterns\". Different from the \"Cloud Patterns\" that adorns Yangyang, these patterns yet share a similar style, adding a classical touch to the characters.</span></p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1693843200000/2liw3u6esbzyhxc7n1-1693896612907.jpg\" alt=\"\" width=\"800\" height=\"800\" /><br /><span style=\"font-size: 14pt;\">The pairing of black and gold, both muted colors, enhances their respective textures. With black as the dominant color, it effectively highlights the metallic and glossy essence of gold. Therefore, we adopted plenty of golden elements as embellishments in Sanhua's details. The golden pendant featuring the wave pattern further brings out Sanhua's heroic bearing on the battlefield.</span></p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1693843200000/po78xi6h4j293jzqnb-1693896679672.jpg\" alt=\"\" width=\"800\" height=\"800\" /><br /><span style=\"font-size: 14pt;\">Originally, Sanhua's eyes were gray. However, the influence of Tacet Discord's frequency transformed them both to striking crimson. Her Tacet Mark is located in her right eye's pupil and only appears when Sanhua uses her Resonance Skill.</span></p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1693843200000/1gin6j1uh2opy3k82j-1693896723786.jpg\" alt=\"\" width=\"800\" height=\"800\" /><br /><br /><span style=\"color: #e03e2d;\"><strong><span style=\"font-size: 14pt;\">Sanhua's Fighting Style</span></strong></span><br /><br /><span style=\"font-size: 14pt;\">Sanhua engages in battles with a calm demeanor, always striving to end the battle swiftly. Her skills are simple yet powerful. She mainly deals damage by detonating the ice creations created by her skills through enhanced Heavy Attacks. Once Sanhua sheaths her sword, the very traces of ice and snow that once existed vanish.</span><br /><br /><br /><span style=\"color: #e03e2d;\"><strong><span style=\"font-size: 14pt;\">Forte Circuit&nbsp;</span></strong></span><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1693843200000/5no0ahzrmdw61uiltj-1693899074012.gif\" alt=\"\" width=\"410\" height=\"231\" /><br /><span style=\"font-size: 14pt;\">In order to minimize the negative effects of her anomalous vision, Sanhua relies on her sense of hearing to more accurately locate her enemies during battles.</span></p>\n<p><span style=\"font-size: 14pt;\">Hold down the Normal Attack button then watch for the indicator above the character status bar. Release the button when the indicator moves inside the Frostbite area, and Sanhua will charge toward the target, performing an enhanced Heavy Attack.</span></p>\n<p><span style=\"font-size: 14pt;\">This Heavy Attack detonates all Ice Prisms and Glaciers along the way.</span></p>\n<p><span style=\"font-size: 14pt;\">Sanhua obtains 1 stack of Clarity upon releasing her Resonance Skill, Resonance Liberation, Concerto Skill, and the final strike of her Normal Attack. Every stack of Clarity expands the Frostbite area in Sanhua's character status bar, making it easier to trigger her enhanced Heavy Attack.</span><br /><br /><br /><span style=\"color: #e03e2d;\"><strong><span style=\"font-size: 14pt;\">Resonance Skill</span></strong></span><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1693843200000/nfg1quyf5ecrbzmzqq-1693897281798.gif\" alt=\"\" width=\"410\" height=\"231\" /><br /><span style=\"font-size: 14pt;\">Sanhua leaps forward to perform a rapid slash attack while creating an Ice Prism on the field.</span><br /><br /><br /><span style=\"color: #e03e2d;\"><strong><span style=\"font-size: 14pt;\">Resonance Liberation</span></strong></span><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1693843200000/nu6l86i6bojjyi5uun-1693897319814.gif\" alt=\"\" width=\"410\" height=\"231\" /><br /><span style=\"font-size: 14pt;\">Sanhua manipulates snow and slashes her sword forward for an AoE attack while creating a wall of Glaciers on the field.&nbsp;</span><br /><br /><br /><span style=\"color: #e03e2d;\"><strong><span style=\"font-size: 14pt;\">Normal Attack</span></strong></span><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1693843200000/zjdgxnw6kyzwstjfo2-1693897342861.gif\" alt=\"\" width=\"410\" height=\"231\" /><br /><span style=\"font-size: 14pt;\">Fully aware of her Forte's potential danger, Sanhua restrains her ability when fighting. She only uses her sheath in the first three stages of her Normal Attack.</span></p>\n<p><span style=\"font-size: 14pt;\">However, when confronted with a villain undeterred by her sheath strikes, Sanhua draws out her sword. With swift motion, she skillfully severs the villain's pant legs, which slide down to his feet, revealing his calves shivering with cold. This trick alone is enough to scare away most people with malicious intentions.</span><br /><br /><span style=\"font-size: 14pt;\">Sanhua is a Resonator stoic, yet all-round on the battlefield. As you continue on your journey, you will have more opportunities to interact with her and grow your understanding of her in person.</span></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n</div>",
  "articleCover": "",
  "articleId": 461,
  "articleTitle": "Developer's Notes — Sanhua",
  "articleType": 57,
  "articleTypeName": "News",
  "contentCover": "",
  "gameId": "G152-en",
  "startTime": "2023-09-05 17:55:00",
  "createTime": "2023-09-05 16:43:59",
  "top": 0
}