{
  "articleContent": "<div>\n<p><br /><span style=\"font-size: 14pt;\">Aalto is a Congenital Resonator. He was born in the New Federation amidst a rare fog that had not been seen for years.</span><br /><br /><br /><br /><strong><span style=\"font-size: 14pt; color: #e03e2d;\">A Street Magician that Brings Joy</span></strong><br /><br /><span style=\"font-size: 14pt;\">Aalto often entertains those with a long face with his magic tricks. In those performances, he shapes little animals with the mist created by his Forte, bringing joy to his audience. Sometimes they take the form of cute bunnies, other times majestic falcons, and even Encore's woolies.&nbsp;</span><br /><br /><span style=\"font-size: 14pt;\">He is flexible like mist and sensitive like air. Aalto can read others' feelings, enveloping them in a lighthearted atmosphere, much like mist. Wherever he goes, cheers and joy always follow him.</span><br /><br /><br /><br /><strong><span style=\"font-size: 14pt; color: #e03e2d;\">A Shrouded Man&nbsp;</span></strong><br /><br /><span style=\"font-size: 14pt;\">Aalto's Forte allows him to conjure mist, shaping it into various forms, or briefly dissolving into it.</span><br /><br /><span style=\"font-size: 14pt;\">Much like the ever-shifting mist, his personality is erratic and unpredictable as well. One can hardly tell his true intentions. After all, for an intelligence broker, concealing weaknesses and veiling true emotions is always the wisest choice.</span><br /><br /><span style=\"font-size: 14pt;\">Yet, when Rover clears up the mist, Aalto's flippant and unreliable facade will be unveiled as mere camouflage. He is thoughtful and meticulous, always allowing him to resolve crises at critical moments. It is safe to conclude that Aalto is, in fact, a dependable man, contrary to what he appears to be.</span><br /><br /><br /><br /><strong><span style=\"font-size: 14pt; color: #e03e2d;\">A Scale of Transaction</span></strong><br /><br /><span style=\"font-size: 14pt;\">On the surface, Aalto appears to be a greedy, venal broker, willing to strike deals with anyone for the right price. However, deep down, he knows well that intelligence can do either good or evil. This realization has led him to establish his own unique pricing criteria &mdash; his scale to determine the value of everything. No one can hustle a deal if it involves intelligence Aalto does not want to sell.</span><br /><br /><span style=\"font-size: 14pt;\">Despite Aalto's catchphrase, \"Availability depends on remuneration\", speculating the ideal offer for his intelligence &mdash; that is, ideal to Aalto &mdash; is never an easy task. Those with unrealistic dreams of amassing wealth by acquiring a piece of vital intelligence will find Aalto's quote astronomically high, whereas a lost girl can easily secure her mother's whereabouts from Aalto by offering him a piece of candy. No one knows what tips the balance on Aalto's scale to obtain the intelligence they desire. However, one thing is certain: you can never attempt to take advantage of Aalto or obtain anything from him that you don't rightfully deserve.</span><br /><br /><br /><br /><strong><span style=\"font-size: 14pt; color: #e03e2d;\">A Perfect Duo</span></strong><br /><br /><span style=\"font-size: 14pt;\">Encore, a whimsical girl, is Aalto's best partner. Together, they embark on journeys filled with bustles while working on quests in the Black Shores. The odd pairing of an unreliable adult and a sensible child may seem peculiar to others, but surprisingly, it works.</span><br /><br /><span style=\"font-size: 14pt;\">Whenever Aalto comes up with his wild plans, Encore is always the first to support him. Having been partners for a long time, she understands that there are always deeper meanings behind his ideas.</span><br /><br /><span style=\"font-size: 14pt;\">To make things easier and gain the trust of people, the two would occasionally pose as a family, with Encore in charge of acting cute and Aalto being her miserable guardian. Although the two often squabble with each other, Aalto would always put Encore's safety first.</span><br /><br /><br /><br /><span style=\"color: #e03e2d;\"><strong><span style=\"font-size: 14pt;\">Aalto's Appearance</span></strong></span></p>\n<p><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1695657600000/kl15uyppti6bkwfdes-1695693740208.jpg\" alt=\"\" width=\"800\" height=\"800\" /><br /><span style=\"font-size: 14pt;\">The devices on Aalto's shoulders strengthen and store the mist he creates. Sometimes Aalto jokingly calls it fire spray on the go.</span></p>\n<p><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1695657600000/levwo37a3shjlk8qpk-1695693770188.jpg\" alt=\"\" width=\"800\" height=\"800\" /><br /><span style=\"font-size: 14pt;\">A seemingly inconspicuous bone flute that is, in fact, a tape recorder that Aalto has owned since he was a child. Aalto carries it with him on various occasions, and this small device has gathered a substantial amount of valuable intelligence for him.</span></p>\n<p><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1695657600000/pa3ztfc79fkrj3gsl5-1695693799177.jpg\" alt=\"\" width=\"800\" height=\"800\" /><br /><span style=\"font-size: 14pt;\">A pair of sunglasses that Aalto always takes with him. They are essential for him when he wants to appear cool.</span></p>\n<p><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1695657600000/7wi8ltjmu74g40zsua-1695693829667.jpg\" alt=\"\" width=\"800\" height=\"800\" /><br /><span style=\"font-size: 14pt;\">Aalto wears a Blake Bloom on his right shoulder to signify his membership with the Black Shores. Only individuals who receive Blake Blooms as invitations are allowed to set foot on the Black Shores' soil.</span></p>\n<p><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1695657600000/4h0qdh2ueqtk8121ig-1695694351701.jpg\" alt=\"\" width=\"800\" height=\"800\" /><br /><span style=\"font-size: 14pt;\">Aalto's Terminal is Black Shores custom-made. It shares a modernist design style with the organization's buildings.</span><br /><br /><br /><br /><strong><span style=\"font-size: 14pt; color: #e03e2d;\">Aalto's Fighting Style</span></strong><br /><br /><span style=\"font-size: 14pt;\">On the battlefield, Aalto's role is not that of a frontline warrior engaging enemies in close combat. Instead, he adopts a more strategic approach, maneuvering around the battle to support his allies. He can create Mist Avatars to taunt the enemies, and allow his teammates to deal damage safely. His Resonance Liberation creates a Gate of Quandary, which enhances ranged attacks launched from behind the Gate.</span><br /><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1695657600000/35zaew9vehh6vg197z-1695700280758.gif\" alt=\"\" width=\"640\" height=\"349\" /><br /><strong><span style=\"font-size: 14pt; color: #e03e2d;\">Forte Circuit</span></strong><br /><br /><span style=\"font-size: 14pt;\">Mistified Shots: Ranged Normal Attacks and Mid-air Attacks deal Aero DMG after passing through the Mist Swirl.</span><br /><br /><span style=\"font-size: 14pt;\">Mistform: Normal Attacks and Mid-air Attack bullets grant Aalto Mist Drops when they pass through Mist Swirls and land on targets. When Aalto passes through Mist Swirls, he enters Mistform and gains increased Movement Speed. In his Mistform, Aalto can continuously consume Mist Drops to conjure Mist Missiles that automatically lock onto enemies.</span></p>\n<p><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1695657600000/o25cfgewprq7i2jae1-1695700314060.gif\" alt=\"\" width=\"640\" height=\"360\" /><br /><br /><strong><span style=\"color: #e03e2d;\"><span style=\"font-size: 14pt;\">Normal Attacks</span></span></strong><br /><br /><span style=\"font-size: 14pt;\">Aalto fires multiple successive shots that generate a Mist Swirl to his front. Bullets passing through the Mist Swirl deal Aero DMG.</span><br /><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1695657600000/7a7m3mhzo3uvq1bbls-1695700452619.gif\" alt=\"\" width=\"640\" height=\"360\" /><br /><br /><strong><span style=\"font-size: 14pt; color: #e03e2d;\">Resonance Skill</span></strong><br /><br /><span style=\"font-size: 14pt;\">Aalto conjures a Mist Swirl and a Mist Avatar that taunts nearby targets, before creating Mist Missiles around the Mist Avatar, dealing Aero DMG.</span><br /><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1695657600000/tuakl1lpgq1991riw0-1695700479501.gif\" alt=\"\" width=\"640\" height=\"360\" /><br /><br /><span style=\"color: #e03e2d;\"><strong><span style=\"font-size: 14pt;\">Resonance Liberation</span></strong></span><br /><br /><span style=\"font-size: 14pt;\">Aalto creates a Gate of Quandary in front of him. Bullets passing through it deal increased damage.</span><br /><br /><span style=\"font-size: 14pt;\">Ranged Resonators work better with Aalto in combat. By taking advantage of Aalto's mist, they can protect themselves from enemy attacks and deal enhanced damage. As an intelligence broker, Aalto profits off danger, but direct confrontation with enemies isn't part of his strategy.</span><br /><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1695657600000/5svl2z74ijca719nnu-1695700522664.gif\" alt=\"\" width=\"640\" height=\"360\" /><br /><br /><span style=\"font-size: 14pt;\">This is all we can currently share about Aalto. The trajectory of his rise is still obscured in mist and awaits your discovery, dear Rovers.</span></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n</div>",
  "articleId": 497,
  "articleTitle": "Developer's Notes — Aalto",
  "articleType": 57,
  "articleTypeName": "News",
  "endTime": "2099-01-01 00:00:00",
  "gameId": "G152-en",
  "startTime": "2023-09-26 18:25:00"
}
