{
  "articleContent": "<div>\n<p><span style=\"font-size: 14pt;\">Mortefi sports a neatly combed horsetail of crimson hair that cascades like a stream of flame. His eyes, deep-set and brimming with prideful aloofness, give off an air of elegant danger.</span><br /><br /><span style=\"font-size: 14pt;\">Unlike the stereotypical researchers, who often come across as rigid and inarticulate, Mortefi exudes a sense of nobility. However, a fervent intensity lurks within his gaze. While his words are gracefully spoken, there lies a dormant dragon within him, nestled amidst the ashes. His politeness, akin to a thin layer of snow, conceals the fiery volcano that awaits its moment to erupt.</span></p>\n<p><br /><span style=\"color: #ba372a;\"><strong><span style=\"font-size: 14pt;\">Crimson Dragon Born in Flames</span></strong></span><br /><br /><span style=\"font-size: 14pt;\">Mortefi's design draws inspiration from the legendary fire-breathing dragons of European folklore.</span><br /><br /><span style=\"font-size: 14pt;\">His right chest bears a Tacet Mark, adorned with a striking red crystalline matter that extends down his right arm. These crystalline formations closely resemble the scales of a dragon. To conceal these unique features, Mortefi covers them with bandages and dons fire-resistant gloves. However, when his fury ignites, these \"scales\" grow exponentially.</span><br /><br /><span style=\"font-size: 14pt;\">The red crystalline substance grants him the ability to manipulate fire. With subtle guidance, he can channel flames down the scales on his arm, creating a mesmerizing display reminiscent of a dragon's mighty claw. When Mortefi fully unleashes his Forte, a spectral dragon manifests behind him, its form composed of blazing petals that dance and flicker with intensity.</span></p>\n<p><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1697990400000/y5vsjad2nu1gu3hk2p-1698044847456.png\" alt=\"\" width=\"800\" height=\"450\" /><br /><br /><br /><br /><br /><span style=\"color: #ba372a;\"><strong><span style=\"font-size: 14pt;\">An Elegant Geek</span></strong></span><br /><br /><span style=\"font-size: 14pt;\">Classical music always fills the air in Mortefi's laboratory, providing the perfect backdrop for his work. With the intricate and precise compositions serving as his muse, Mortefi would write scientific equations with flames in the air as he contemplated his latest research, much like a devoted conductor leading an orchestra.</span><br /><br /><span style=\"font-size: 14pt;\">Even on the busiest of research days, Mortefi never neglects his afternoon tea ritual. He firmly believes that indulging in fine desserts helps replenish the energy his brilliant mind consumes.</span><br /><br /><span style=\"font-size: 14pt;\">While Mortefi's noble heritage demands a flawless image, he devotes minimal time to anything other than his research. His crimson hair, though simply combed, always remains impeccably neat. Similarly, Mortefi's pristine white robe, his constant attire, rarely bears any signs of wrinkles or stains. His obsession with cleanliness and orderliness extends seamlessly into his laboratory, where everything is meticulously arranged.</span><br /><br /><br /><br /><br /><strong><span style=\"font-size: 14pt; color: #ba372a;\">Hubristic, Irritable, but Never Cruel</span></strong><br /><br /><span style=\"font-size: 14pt;\">The combination of Mortefi's chilling face and proud eyes immediately convey that he is not someone amiable.&nbsp;</span><br /><br /><span style=\"font-size: 14pt;\">His patience for anything outside of his lab is incredibly limited, easily leading to agitation. In these moments, he subconsciously starts fidgeting with a lighter adorned with dragon patterns.&nbsp;</span><br /><br /><span style=\"font-size: 14pt;\">Usually, Mortefi doesn't use this lighter for ignition; but once the bear is poked, he won't need a lighter for fire anyway.</span><br /><br /><span style=\"font-size: 14pt;\">In European folklore, dragons are often associated with chaos and evil, known as fire breathers and fearmongers. Mortefi, however, never uses his fire irresponsibly.&nbsp;</span><br /><br /><span style=\"font-size: 14pt;\">Born into nobility, he was raised and educated in a manner that molded his hubris and grace. Yet, amidst the aristocratic circles he inhabited, he couldn't help but notice the hypocrisy and indifference that pervaded their interactions. This realization ignited a flame within him, one that he cleverly wielded to mock the imperious and scorch those lacking sincerity.</span></p>\n<p><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1697990400000/bv2w9bkxui8c316az7-1698044908027.png\" alt=\"\" width=\"800\" height=\"450\" /><br /><br /><br /><br /><span style=\"color: #ba372a;\"><strong><span style=\"font-size: 14pt;\">Dragon? Grumpy Cat!</span></strong></span><br /><br /><span style=\"font-size: 14pt;\">Mortefi is not one to get angry for no reason. Deep down, he is a gentle soul who responds well to coaxing. Whenever he starts getting cranky, a small concession from his funders, accompanied by praise for his creations, is all it takes to make him approachable once again.</span><br /><br /><span style=\"font-size: 14pt;\">In fact, as long as you can clearly articulate what kind of invention you want, he is willing to strive towards making your desires a reality, no matter how unrealistic they may sound. Sometimes, this irritable \"Red Dragon\" feels more like a grumpy, puffed-up cat, who can be easily appeased with simple petting.</span><br /><br /><span style=\"font-size: 14pt;\">Perhaps you could even try keeping Mortefi in a state of alternating calm and anger by provoking him and then immediately offering consolation? Do it at your own risk, though...</span></p>\n<p><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1697990400000/6qbddgr3v3k11ljobj-1698044943807.png\" alt=\"\" width=\"800\" height=\"450\" /><br /><br /><br /><br /><span style=\"color: #ba372a;\"><strong><span style=\"font-size: 14pt;\">A Fire Exclusive to Mortefi</span></strong></span><br /><br /><span style=\"font-size: 14pt;\">Flames manifest in various hues. Mortefi's fire possesses a distinct crimson color that symbolizes unbridled wrath. It mirrors the blistering flow of lava beneath solid stone and smoldering cinder. Born from his repressed childhood and taxing career, this fire within him ignited under certain circumstances. Fueling his heart with wrath, Mortefi harnesses his blaze to incinerate hypocrites and snobs who dare cross his path.</span><br /><br /><span style=\"font-size: 14pt;\">However, his flames now find a different purpose as he dedicates himself to research. As long as his temper remains ablaze, the fire within Mortefi will never cease.&nbsp;</span><br /><br /><span style=\"font-size: 14pt;\">Perhaps, as a brilliant inventor, he has already planned the intricate circuitry that fuels his fury.</span><br /><br /><br /></p>\n<p><br /><span style=\"color: #ba372a;\"><strong><span style=\"font-size: 14pt;\">Blaze Blooms in Bile</span></strong></span><br /><br /><span style=\"font-size: 14pt;\">Mortefi's fire is a substantialization of his accumulated negative emotions. As the combat unfolds, Annoyance builds up in him, which, when fully charged, will result in an enhanced Resonance Skill. By then, his enemy will know the furious Dragon's flame.</span><br /><br /><br /><br /><br /><span style=\"color: #ba372a;\"><strong><span style=\"font-size: 14pt;\">Basic Attack</span></strong></span><br /><br /><span style=\"font-size: 14pt;\">Mortefi uses pistols empowered with Tacetite energy.&nbsp;</span><br /><br /><span style=\"font-size: 14pt;\">He shoots gracefully and lethally. Every shot that hits the enemies builds up his Annoyance.</span><br /><br /><span style=\"font-size: 14pt;\">Hold down the attack button, and Mortefi will gracefully aim at enemies with even greater precision, unleashing enhanced shots that inflict more damage.</span></p>\n<p><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1697990400000/362hh2pddwo7lzpx6g-1698050314787.gif\" alt=\"\" /><br /><br /><br /><br /><strong><span style=\"font-size: 14pt; color: #ba372a;\">Resonance Skill</span></strong><br /><br /><span style=\"font-size: 14pt;\">The Red Dragon roars amidst the ashes of its enemies, unleashing fiery blazes as a form of punishment. Mortefi swiftly fires a blaze towards the front, simultaneously building up Annoyance.</span><br /><br /><span style=\"font-size: 14pt;\">When Annoyance is maxed, Mortefi's Resonance Skill is immediately refreshed and enhanced. His enhanced Resonance Skill utilizes all the stored Annoyance to release a scorching streak of flames, inflicting greater damage upon a wider range of enemies.</span></p>\n<p><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1697990400000/y51l9rjhvdm4lvqjqj-1698050345572.gif\" alt=\"\" /><br /><br /><br /><br /><span style=\"color: #ba372a;\"><span style=\"font-size: 18.6667px;\"><strong>Forte Circuit</strong></span></span><br /><br /><span style=\"font-size: 14pt;\">Mortefi is always suppressing his temper, but the flames he controls in battle only serve to further fuel his frustration. Once Annoyance is maxed, Mortefi fully embraces the Red Dragon of his wrath. Summoning a spectral dragon from the fiery depths, Mortefi unleashes it upon a broader array of foes, while simultaneously expending all of his built-up Annoyance.</span><br /><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1697990400000/thrzrdikpd7ikekyo6-1698050368292.gif\" alt=\"\" /><br /><br /><br /><span style=\"color: #ba372a;\"><strong><span style=\"font-size: 14pt;\">Resonance Liberation</span></strong></span><br /><br /><span style=\"font-size: 14pt;\">The Red Dragon asserts his dignity through fiery flames. Mortefi inflicts aerial damage upon nearby enemies.&nbsp;</span><br /><br /><span style=\"font-size: 14pt;\">As the waves of fire intensify, his adversaries have no choice but to surrender to the Dragon's awe-inspiring presence.</span></p>\n<p><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1697990400000/gd6wx6xc9n6gk3c6x2-1698045093276.gif\" alt=\"\" width=\"800\" height=\"431\" /><br /><br /></p>\n<hr />\n<p><br /><span style=\"font-size: 14pt;\">This is all we have to share at the moment about Mortefi, the brilliant inventor with a fiery temper, and a nobleman whose impatience yearns for a soothing touch.</span></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n</div>",
  "articleId": 526,
  "articleTitle": "Developer's Note — Mortefi",
  "articleType": 57,
  "articleTypeName": "News",
  "endTime": "2099-01-01 00:00:00",
  "gameId": "G152-en",
  "startTime": "2023-10-23 17:55:00"
}
