{
  "articleContent": "<div>\n<p><span style=\"font-size: 14pt;\">This time, we would like to introduce to you the backstory of Danjin, a red-haired ranger girl.</span><br /><br /></p>\n<p><strong><span style=\"font-size: 14pt; color: #e03e2d;\">Danjin's Appearance</span></strong><br /><br /><span style=\"font-size: 14pt;\">Danjin is a girl whose fiery red hair is as vibrant as balsam. Both her hair and her attire exude this striking hue.</span><br /><br /><span style=\"font-size: 14pt;\">Elegantly styled in a youthful bun, her hair is adorned with a vintage hairpin at the temple, adding a touch of cuteness to her already charming appearance. Her clothing, steeped in traditional Chinese style, is specially tailored for ease of movement, from the satin ribbons to the ring-shaped neck ornament known as Yingluo, and even the crimson leg garter adorning her right thigh. All these elements come together to express the liveliness of a young girl.</span><br /><br /><span style=\"font-size: 14pt;\">Amidst the deep red tones that envelop her, a clear and bright jade pendant hangs from Danjin's neck. In her hometown, a beautiful jade is referred to as \"Jin,\" a name she shares. It is evident that this jade holds great significance for her. However, the pendant was once part of a perfect circle, and the missing piece remains a mystery, leaving a sense of intrigue.</span><br /><br /><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1700496000000/fz6r3qvlcetlxgtcyl-1700551093804.jpg\" alt=\"\" width=\"800\" height=\"450\" /><br /><br /><br /><strong><span style=\"font-size: 14pt; color: #e03e2d;\">A Sweet and Righteous Ranger Girl</span></strong><br /><br /><span style=\"font-size: 14pt;\">Danjin's jade pendant carries her family's blessings, as her parents wished for her to grow into an upright and virtuous person. When she was younger, Danjin didn't fully understand the meaning of being \"upright and virtuous.\" As she later embarked on a journey in search of a certain criminal, she gradually came to understand the true essence of her parents' wishes.&nbsp;</span><br /><br /><span style=\"font-size: 14pt;\">With a polite ranger tone and graceful actions, she embodies the heroic spirit of a dedicated martial artist and swordswoman. Her unwavering gaze reflects her pure intentions, free from any malice.</span><br /><br /><span style=\"font-size: 14pt;\">Despite her mature demeanor, Danjin has a sweet tooth and a particular fondness for the renowned Huanglong dessert, Loong Whiskers Crisp. When people catch a glimpse of her savoring the crisp with sheer delight, they are reminded that she is, after all, still a young girl.</span></p>\n<p><br /><strong><span style=\"font-size: 14pt; color: #e03e2d;\">A Virtuous Maiden</span></strong><br /><br /><span style=\"font-size: 14pt;\">Despite her youth, Danjin is far from a dreamy-eyed idealist.&nbsp;</span><br /><br /><span style=\"font-size: 14pt;\">Her disgust is palpable whenever she speaks of her encounters with wrongdoers, revealing a clear understanding of right and wrong. Even when criminals attempt to deceive her with their silver tongues, she remains unfazed.&nbsp;</span><br /><br /><span style=\"font-size: 14pt;\">Danjin fearlessly points out the truth without hesitation, a quality that may appear naive. However, it is precisely this quality that garners her the respect of others.</span><br /><br /><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1700496000000/7nceb0ivwz0wgqeg20-1700551200102.jpg\" alt=\"\" width=\"800\" height=\"450\" /><br /><br /></p>\n<p><br /><span style=\"font-size: 14pt;\">Over time, tales spread of a young girl adorned in crimson, her neck adorned with a jade pendant.&nbsp;</span><br /><br /><span style=\"font-size: 14pt;\">Some recall witnessing a young girl \"falling prey\" to deceitful villains, yet their own fear held them back from speaking up. However, they later learned that those villains had mysteriously vanished, never to be seen again. Others speak of a girl wandering with a worn-out blade, fervently seeking a blacksmith to restore it. As the tale is told, she appears to possess the aura of a formidable berserker.</span><br /><br /></p>\n<p><br /><br /><strong><span style=\"font-size: 14pt; color: #e03e2d;\">Danjin's Fighting Style</span></strong><br /><br /><span style=\"font-size: 14pt;\">Danjin wields her blood as a blade, its edge honed by the blood of her enemies. In battle, she harnesses her own blood to create a second sword. Danjin can sacrifice her own HP to amplify the damage she inflicts.</span><br /><br /><strong><span style=\"font-size: 14pt; color: #e03e2d;\">Normal Attacks</span></strong><br /><br /><span style=\"font-size: 14pt;\">Danjin swiftly thrusts her sword at her enemy.</span><br /><br /><span style=\"font-size: 14pt;\">When dealing Heavy Attacks, Danjin delivers three rapid slashes in a row.</span></p>\n<p><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1700496000000/bbrako54u55afxxg9z-1700551355189.gif\" alt=\"\" width=\"700\" height=\"377\" /></p>\n<p><strong><span style=\"font-size: 14pt; color: #e03e2d;\">Resonance Skill</span></strong><br /><br /><span style=\"font-size: 14pt;\">Danjin consumes her HP to create a Crimson Blade. Her skill is performed in different ways based on the number of attacks she executes:</span><br /><br /><span style=\"font-size: 14pt;\">Releasing her Resonance Skill after 1 Normal Attack, she unleashes a fierce upward slash towards her enemy.</span><br /><br /><span style=\"font-size: 14pt;\">Releasing her Resonance Skill after 2 Normal Attacks, she executes a cross-shaped slash with her sword and blood sword.</span><br /><br /><span style=\"font-size: 14pt;\">Releasing her Resonance Skill after 3 Normal Attacks, she performs a rapid succession of slashes.</span></p>\n<p>&nbsp;</p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1700496000000/u4vw32nxk271ilz2fb-1700551395492.gif\" /></p>\n<p><br /><strong><span style=\"font-size: 14pt; color: #e03e2d;\">Forte Circuit</span></strong><br /><br /><span style=\"font-size: 14pt;\">Danjin's Forte Gauge fills up as she uses her Resonance Skill. When the Forte Gauge is full, her Heavy Attacks will steal the enemy's HP.</span></p>\n<p>&nbsp;</p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1700496000000/jd6yi7bc4uoxkyj4fk-1700551429596.gif\" alt=\"\" width=\"700\" height=\"377\" /></p>\n<p>&nbsp;</p>\n<p><strong><span style=\"font-size: 14pt; color: #e03e2d;\">Resonance Liberation</span></strong><br /><br /><span style=\"font-size: 14pt;\">After Danjin releases her Resonance Liberation, she performs multiple slashes in quick succession. Glimmers of the swords dance like flowing water upon the bodies of her foes, eventually converging into a sea of darkness tinged with red.</span><br /><br /></p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1700496000000/1dbo1rzg153f2fn19g-1700551460275.gif\" alt=\"\" /></p>\n<p>&nbsp;</p>\n<p><br /><br /><span style=\"font-size: 14pt;\">Danjin travels in the world at a young age. Along the way, she discovers the profound essence of righteousness and virtue. Her initial quest for revenge on behalf of her family gradually morphs into a noble mission to rid the world of evil.</span><br /><br /><span style=\"font-size: 14pt;\">This lone ranger girl lives a life of constant battles. Amidst the clatter of metal, Danjin stands unfazed. Even as her clothes become stained with blood, her jade pendant remains unblemished, signifying her unwavering will.</span></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n</div>",
  "articleCover": "",
  "articleId": 549,
  "articleTitle": "Developer's Notes — Danjin",
  "articleType": 57,
  "articleTypeName": "News",
  "contentCover": "",
  "gameId": "G152-en",
  "startTime": "2023-11-21 17:55:00",
  "createTime": "2023-11-21 16:52:07",
  "top": 0
}