{
  "articleContent": "<div>\n<p><span style=\"color: #e03e2d;\"><strong><span style=\"font-size: 14pt;\">Yuanwu's Story</span></strong></span><br /><br /><span style=\"font-size: 14pt;\">Yuanwu is a martial artist known for his mastery of Leihuangquan, a swift and powerful style named after lightning and thunder. His lightning-fast fists strike with streaks of blue energy, leaving his opponents reeling from the full force of their destructive power.</span><br /><br /><span style=\"font-size: 14pt;\">As a teenager, Yuanwu sought absolute power and relied on raw force to defeat his enemies. This obsession led to his downfall, as he fell into a trap laid by his rival and was exiled from his home.</span><br /><br /><span style=\"font-size: 14pt;\">During his years of wandering, Yuanwu reflected on his past mistakes and honed his martial arts skills. With his expanding knowledge and improved techniques, he gradually grasped the essence of Leihuangquan &mdash; the art of balance between strength and adaptability. A martial artist's path of vengeance is destined to begin and end on the fighting ground. As fate would have it, his sworn enemy crossed paths with him once again in the arena, where their conflict would come to its ultimate climax.</span><br /><br /><span style=\"font-size: 14pt;\">As lightning flashed, Yuanwu's fist broke through his opponent's gauntlet, revealing the illegal add-on hidden within. This moment marked Yuanwu's mastery of Leihuangquan, and exposed the years of lies and slander that had been concealed for ages.</span><br /><br /><span style=\"font-size: 14pt;\">The tale of Yuanwu's vengeance drew to a close, but his story as a boxing gym owner was only beginning.</span><br /><br /><span style=\"font-size: 14pt;\">\"Welcome to Yuanwu&rsquo;s Boxing Gym.\"&nbsp;</span><br /><br /><span style=\"font-size: 14pt;\">Yuanwu, now an amiable middle-aged proprietor, can always be found at the entrance of his boxing gym, greeting visitors with a warm smile daily.</span><br /><br /><br /><br /><span style=\"color: #e03e2d;\"><strong><span style=\"font-size: 14pt;\">A Modest Gentleman</span></strong></span><br /><br /><span style=\"font-size: 14pt;\">Gone are the days when the young Yuanwu fought his way with brute force. He has matured into a composed and confident middle-aged gentleman.</span><br /><br /><span style=\"font-size: 14pt;\">Yuanwu dons a dark-colored coat paired with a white top hat that perfectly aligns with his composed, modest, and courteous demeanor. The tailored waistcoat underneath highlights his robust physique, reflecting his years of martial arts training. The addition of navy blue in his attire further elevates the impression of thunder and lightning.</span><br /><br /><span style=\"font-size: 14pt;\">Though known to those around him as a kind gentleman, Yuanwu sheds his usual composed demeanor when faced with combat. He swiftly unleashes precise and fierce strikes, overwhelming his opponents. Yuanwu does not like to engage in physical altercations, but once forced into it, he throws himself fully into the fight, aiming for a quick and resounding victory.</span></p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1701964800000/ai2cfj1rho340oz6e8-1702030446852.png\" alt=\"\" width=\"800\" height=\"450\" /><br /><br /><br /><strong><span style=\"font-size: 14pt; color: #e03e2d;\">A Dedicated Mentor</span></strong><br /><br /><span style=\"font-size: 14pt;\">In Yuanwu's boxing gym, every visitor can receive dedicated coaching from the owner himself.</span><br /><br /><span style=\"font-size: 14pt;\">Whether the person wants to exercise, pursue a career in boxing, or simply soak up the energizing ambiance of the gym, Yuanwu is always ready to suggest tailored training plans based on their unique physical abilities and health needs.</span><br /><br /><span style=\"font-size: 14pt;\">At the end of every training session, Yuanwu always graciously serves his clients with a cup of Trine Tea.&nbsp; He takes great care in preparing each cup himself. The steaming hot tea effectively soothes the sore muscles and fatigue from the intense workout. Yuanwu's boxing gym is a unique place where clients can engage in a spirited boxing match and then relax with a pot of tea, basking in comfort and contentment.</span><br /><br /><br /><br /><strong><span style=\"font-size: 14pt; color: #e03e2d;\">Yuanwu&rsquo;s Secret For Wellness</span></strong><br /><br /><span style=\"font-size: 14pt;\">Yuanwu is a regular consumer of Bittberry Tea from the renowned Liuxian Teahouse. This secret blend is known for its intense bitterness and exorbitant price, making it a luxury only a select few can afford. Rumor has it that Yuanwu is the only one who can down a cup without flinching.</span><br /><br /><span style=\"font-size: 14pt;\">Yuanwu always carries a flask with him during his daily activities. Some say it contains his secret potion for staying fit, but in reality, it's usually just ordinary hot water.</span></p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://hw-media-cdn-mingchao.kurogame.com/akiwebsite/website2.0/images/1702224000000/6067jhf84u648ixhrv-1702287340980.png\" alt=\"\" width=\"800\" height=\"450\" /><br /><br /><br /><br /><br /><strong><span style=\"font-size: 14pt; color: #e03e2d;\">Yuanwu's Fighting Style</span></strong><br /><br /><span style=\"font-size: 14pt;\">When in combat, Yuanwu maintains his elegant composure. His mastery of lightning manipulation amplifies his team's capabilities and shines through in his impressive combat skills. When the situation turns dire, Yuanwu can take charge as the team's primary damage dealer, unleashing powerful fists of twisting thunder to crush any enemy in their path.</span><br /><br /><br /><br /><br /><span style=\"color: #e03e2d;\"><strong><span style=\"font-size: 14pt;\">Normal Attacks</span></strong></span><br /><br /><span style=\"font-size: 14pt;\">Yuanwu performs up to five consecutive strikes with swift punches and kicks.</span><br /><br /><span style=\"font-size: 14pt;\">Being the gentleman that he is, Yuanwu gracefully removes his top hat as a salutation before engaging in combat, a gesture that is also integrated into the movement design of his Normal Attacks.</span><br /><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1701964800000/q5uc4xms7na9e3mkct-1702017853296.gif\" alt=\"\" width=\"600\" height=\"323\" /><br /><br /><strong><span style=\"font-size: 14pt; color: #e03e2d;\">Resonance Skill</span></strong><br /><br /><span style=\"font-size: 14pt;\">Yuanwu converges Electro energy to summon a pillar of thunder which generates an electric field.</span><br /><br /><span style=\"font-size: 14pt;\">Attacks performed by all team members within this field trigger the pillar's coordinated attacks, dealing Electro damage.</span><br /><br /><span style=\"font-size: 14pt;\">While present, the pillar continuously fills up Yuanwu's Forte Gauge. The coordinated attacks triggered accelerate his Forte Gauge.</span><br /><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1701964800000/wg975l0znvxqs89omi-1702017869017.gif\" alt=\"\" width=\"600\" height=\"323\" /><br /><br /><span style=\"color: #e03e2d;\"><strong><span style=\"font-size: 14pt;\">Forte Circuit</span></strong></span><br /><br /><span style=\"font-size: 14pt;\">Once Yuanwu's Forte Gauge is fully charged, hold down the Resonance Skill button to consume all of his Forte Gauge energy and enter an enhanced state.</span><br /><br /><span style=\"font-size: 14pt;\">In this state, Yuanwu gains increased resistance to interruption and his attacks are enhanced: His Basic Attacks have added SFX and a wider range, while Heavy Attack, Extreme Evasion, and Parry trigger additional Electro damage.</span><br /><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1701964800000/umjn2ob33bu2znr73m-1702017883188.gif\" alt=\"\" width=\"600\" height=\"338\" /><br /><br /><strong><span style=\"font-size: 14pt; color: #e03e2d;\">Resonance Liberation</span></strong><br /><br /><span style=\"font-size: 14pt;\">Lightning of dark blue converges upon Yuanwu's fists before setting loose onto his opponents in a bombardment of punches. The raging thunderstorm inflicts two consecutive hits of ranged AOE damage upon enemies to his front. The released lightning energy also grants all team members increased resistance to interruption.</span></p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://dev-hw-media-cdn-mingchao.kurogame.com/akiwebsite/images/1701964800000/svgt4v1dcq657d435w-1702017933178.gif\" alt=\"\" width=\"600\" height=\"323\" /></p>\n<p><span style=\"font-size: 14pt;\">The roaring thunder can conquer any enemy, but it may also scar its wielder in turn. Yuanwu has come to learn the importance of balancing strength and flexibility for lasting success, but he is not one to impose his knowledge on others. If someone were to seek his advice, he would simply suggest taking a moment to relax, savor a cup of tea, and follow their intuition in navigating life's challenges.</span></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n</div>",
  "articleId": 573,
  "articleTitle": "Developer's Notes — Yuanwu",
  "articleType": 57,
  "articleTypeName": "News",
  "endTime": "2099-01-01 00:00:00",
  "gameId": "G152-en",
  "startTime": "2023-12-11 17:55:00"
}
