{
  "articleContent": "<div>\n<p><span style=\"font-size: 14pt; font-family: 微软雅黑;\"><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://hw-media-cdn-mingchao.kurogame.com/object/1711036800000/s4bzrboerjng5l10il-1711099121443.jpg\" alt=\"\" width=\"800\" height=\"450\" /></span></p>\n<p>&nbsp;</p>\n<p><span style=\"font-size: 14pt; font-family: 微软雅黑;\">Dear Rovers,</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">We would like to first express our sincere gratitude. Thank you for participating in and paying attention to our Closed Beta Test II. We received a lot of valuable feedback from all platforms.&nbsp;</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">After careful consideration, we have finalized our plans for future adjustments and optimizations, and we would like to share them with you.&nbsp;</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">We hope this Developer's Message addresses any questions you may have. Your continued support means the world to us.</span><br /><br /><br /><strong><span style=\"font-size: 14pt; font-family: 微软雅黑;\">A. COMBAT</span></strong><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">1. Overall Combat Experience Optimizations</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">We are addressing the issue of poor sound effects and hit feedback many of our players mentioned. We will focus on revamping the sound effects of weapon hit feedback, Echo Skills, Resonance Skills, and other battle aspects. In addition, we'll improve jumping by adjusting animation speed, camera transitions, and landing feedback to make it feel more natural.</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">2. Character-specific Combat Optimizations</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">We will be making specific adjustments for characters frequently mentioned in the feedback we received.&nbsp;</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">Our current plans include:</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">① Adjust Lingyang and Jianxin's movesets for an elevated overall combat experience;&nbsp;</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">② Adjust Verina's HP restoration mechanism so she can use her Photosynthesis Energy more efficiently;</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">③ Improve Calcharo's kit. His extra Intro Skill \"Necessary Means\" will be available by default.</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">3. New Combat Skill Practicing Dungeons</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">We will introduce a series of new Combat Practicing dungeons where you can better familiarize yourself with each character's unique combat mechanisms, and practice how to combo.</span><br /><br /></p>\n<p><span style=\"font-size: 14pt; font-family: 微软雅黑;\">Aside from the points above, we have also started working on other frequently reported issues, such as bad camera experiences, frequent lock-on loss, enemies quitting combat, and counterattack failures.</span><br /><br /><br /><strong><span style=\"font-size: 14pt; font-family: 微软雅黑;\">B. GAMEPLAY</span></strong><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">1. Echo System</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">We received a lot of feedback on the Echo system. Thank you so much for taking the time to test out this system and providing valuable suggestions!&nbsp;</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">We have received many suggestions and concerns about how the Echo hunting experience was too grindy, how the game lacked disposal options for unwanted Echoes, and other issues.</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">To address these issues, we are planning to implement the following changes:</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">① Make it easier to obtain various Echoes.&nbsp;</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">We plan to make Echoes available through participating in-game events, completing daily activities, and other means.</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">② Provide a better way to dispose of unused or redundant Echoes.</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">You will be able to recycle unenhanced Echoes by converting them into random new Echoes of a type you have unlocked.</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">③ Return Turners when Tuned Echoes are consumed.</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">When you use Tuned Echoes to upgrade other Echoes, a designated % of Tuners you previously used will be returned.</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">④ Make it easier to get your desired Substats.</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">We will raise the minimum numbers you can get with substats rolling, and narrow the range of possible rolling results.</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">⑤ Optimize the auto-equip Echoes mechanism.</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">Additionally, we will improve Inferno Rider's Echo Skill to add a new transformation mode. When equipped, you can transform into the Infernal Rider.&nbsp;</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">We will be developing even more new events and new gameplays centered around the Echoes, and improve them based on your feedback to create unique experiences.</span><br /><br /><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://hw-media-cdn-mingchao.kurogame.com/object/1711036800000/iwfzitz8ecm4lhpf6m-1711099159988.gif\" alt=\"\" width=\"800\" height=\"450\" /><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">2. New Content for \"Depths of Illusive Realm\"</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">We will add a Tutorial Stage for \"Depths of Illusive Realm\" to help beginners better understand and enjoy this gameplay.&nbsp;</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">More playable characters will be added in \"Deapths of Illusive Realms\". Additionally, you will also be able to use trial characters in this mode. Meanwhile, new high-difficulty events and special boss mechanisms will be added for you to challenge.</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">We are also working on other gameplay issues mentioned in your feedback.&nbsp;</span><br /><br /></p>\n<p><span style=\"font-size: 14pt; font-family: 微软雅黑;\">Here are a few examples: Drops from Supply Chests or enemies in the wild will be automatically picked up; Co-op mode will be available sooner, at a lower Union Level; A batch salvaging option for unwanted items in your backpack... We hope these changes can further improve your game experience.</span><br /><br /><br /><strong><span style=\"font-size: 14pt; font-family: 微软雅黑;\">C. STORY CUTSCENES &amp; ANIMATIONS</span></strong><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">We are working on the frequently reported issues about story cutscenes &amp; animations, including strange camera positionings, characters showing up at the wrong time, poorly matched lip animations, and lack of detail in story sound effects. Here are some of the progress we've made so far:</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">① Optimized the camera positioning and character animation in some parts of the story. Improved lip animation and eyeblink animation.</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">② Adjusted and rearranged the story quests&rsquo; progression for a smoother flow, and changed the unlock prerequisites for some story quests.</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">③ Reworked the sound effects in cutscenes for a better performance.</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">④ Improved the \"Skip\" function to make it work better.</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">We will keep polishing every detail of story cutscenes and animations to optimize the quality. We hope this will help you better enjoy the story quests.</span><br /><br /><br /><strong><span style=\"font-size: 14pt; font-family: 微软雅黑;\">D. OTHER OPTIMIZATIONS &amp; ADJUSTMENTS</span></strong><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">Aside from the changes above, we are addressing game issues such as crashes, blank screens, frame drops, and device overheating. Improving game performance on all devices is a top priority. We're also improving the Character and Environment Designs and adjusting the UI for easier navigation. New events and story content are in early development and we'll share our progress with you.</span><br /><br /><br /><strong><span style=\"font-size: 14pt; font-family: 微软雅黑;\">E. LOCALIZATION</span></strong><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">We take localization quality very seriously, and it is also a big part of our future optimization plans. We will continuously improve the localization quality based on your feedback. We are working on adding EN/JP/KR voice-overs for stories and character voicelines. Thank you for your patience!</span><br /><br /><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">These are our future adjustments and optimizations based on the feedback we received during CBT II. These are our future adjustments and optimizations based on the feedback we received during CBT II. We apologize for any deficiencies or unsatisfactory content in the beta test build. The development team is committed to addressing these issues and prioritizing areas that were less enjoyable for players. Our goal is to bring you an even better version of Wuthering Waves next time.</span><br /><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">Thank you again for your continued attention and support!</span><br /><br /><br /><br /></p>\n<p style=\"text-align: right;\"><strong><span style=\"font-size: 14pt; font-family: 微软雅黑;\">Wuthering Waves Dev Team</span></strong></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n</div>",
  "articleId": 690,
  "articleTitle": "Developer's Message: CLOSED BETA TEST II Review",
  "articleType": 58,
  "articleTypeName": "Notice",
  "endTime": "2099-01-01 00:00:00",
  "gameId": "G152-en",
  "startTime": "2024-03-22 18:00:00",
  "createTime": "2024-03-22 17:21:21",
  "sortingMark": 246,
  "top": 0
}