{
  "articleContent": "<div>\n<p><span style=\"font-size: 14pt; font-family: 微软雅黑;\"><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://hw-media-cdn-mingchao.kurogame.com/object/1716134400000/wvu6yh4pcmamd21xld-1716190826696.jpg\" alt=\"\" width=\"800\" height=\"450\" /></span></p>\n<p>&nbsp;</p>\n<p><span style=\"font-size: 14pt; font-family: 微软雅黑;\">Dear Rovers,</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">As part of our commitment to providing a fair and positive gaming experience for all Rovers in Wuthering Waves, we uphold the following principles in our service:</span><br /><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\"><strong>1. Strict Prohibition of Third-party Applications to Disrupt Gaming Experience. </strong>The use of illegal third-party tools, including cheating programs, accelerators, macro commands, etc., to gain unfair advantages in the game is strictly prohibited. This includes but is not limited to activities such as automatic farming, cooldown alteration, invulnerability mode, teleportation, and modification of game data. Any proven use of such tools will result in immediate action, including but not limited to the removal of illegal gains, account suspension, or permanent ban, depending on the severity and frequency of the offense.</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\"><strong>2. Strict Prohibition of Account Sale, Purchase, or Transfer. </strong>Please be reminded not to engage in any transactions that involve selling, purchasing, or sharing accounts. Any loss or disputes resulting from such activities will be the sole responsibility of the parties involved.</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\"><strong>3. Strict Prohibition of Top-up via Third-party Applications and Refund Abuse. </strong>Any such attempts will be met with swift action, including but not limited to the removal of illegal gains, account suspension, or permanent ban, depending on the severity and frequency of the offense.</span><br /><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">We are committed to maintaining a fair gaming experience in Wuthering Waves for all Rovers. As such, we encourage the reporting of any violations by contacting our [Customer Service]. Each report will be investigated, and appropriate action taken against disruptive behavior.</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">Official Customer Service: <span style=\"color: #e67e23;\"><strong><a style=\"color: #e67e23;\" href=\"wutheringwaves_ensupport@kurogames.com\">wutheringwaves_ensupport@kurogames.com</a></strong></span></span><br /><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">We sincerely appreciate your cooperation in maintaining a fair and positive gaming experience for all Rovers in Wuthering Waves. Thank you for your understanding and support!</span><br /><br /><br /></p>\n<p style=\"text-align: right;\"><span style=\"font-size: 14pt; font-family: 微软雅黑;\">Wuthering Waves Dev Team</span></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n</div>",
  "articleCover": "",
  "articleId": 742,
  "articleTitle": "Wuthering Waves Fair Play Policy",
  "articleType": 58,
  "articleTypeName": "Notice",
  "contentCover": "",
  "gameId": "G152-en",
  "startTime": "2024-05-20 15:40:33"
}
