{
  "articleContent": "<p><strong><span style=\"font-size: 14pt; font-family: 微软雅黑;\">1. The \"Login Timeout\" issue:</span></strong><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">Some players may have encountered a \"Login Timeout\" error while trying to log in to the game. This has been fixed and was found to be related to certain network service providers. If you still experience this issue, please contact customer service with your device model and carrier for further investigation.</span><br /><br /><br /><strong><span style=\"font-size: 14pt; font-family: 微软雅黑;\">2. Players in certain areas cannot perform age authentication:</span></strong><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">In certain areas, players may have difficulty performing age authentication if their mobile phone is in \"Night Mode\". We are currently investigating this issue.</span><br /><br /><br /><strong><span style=\"font-size: 14pt; font-family: 微软雅黑;\">3. Players may need to log in again every time the game client is relaunched on PC:</span></strong><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">This happens when exiting the game using the power icon in the bottom-left corner on the ESC menu, which brings you back to the title screen. In this case, you would need to log in again when resuming the game. We are aware of this issue and are working on optimizing the UI to prevent confusion in future updates.</span><br /><br /><br /><strong><span style=\"font-size: 14pt; font-family: 微软雅黑;\">4. About Unreal Engine 4 crash reports:</span></strong><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">Some players may receive error messages from Unreal Engine 4 and experience crashes while loading the splash screens. There are multiple factors that could have caused this issue. We're collecting the relevant error details and identifying the cause. We'll fix this issue as soon as possible with a patch.</span><br /><br /><br /><strong><span style=\"font-size: 14pt; font-family: 微软雅黑;\">5. About the compatibility issue with certain Android devices:</span></strong><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">It has been brought to our attention that Rovers playing from certain Samsung devices with Exynos series processors may encounter glitches with character actions and movements. We have identified the cause of the problem and will fix this issue through a patch as soon as possible.</span><br /><br /><br /><strong><span style=\"font-size: 14pt; font-family: 微软雅黑;\">6. About localization quality:</span></strong><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">We have received feedback regarding the localization quality of the game. Ensuring high-quality localization has always been a priority for us, and we are fully committed to improving it. Currently, our team is endeavoring to continuously rectify and optimize the localized texts to provide an enjoyable experience for Rovers everywhere. Fixes to some of the known issues with the current localized texts will be included in the patches to be released soon. Meanwhile, if you have any feedback regarding localization, please reach out to our Customer Support at: </span><span style=\"color: #e67e23;\"><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\"><a style=\"color: #e67e23;\" href=\"wutheringwaves_ensupport@kurogames.com\">wutheringwaves_ensupport@kurogames.com</a></span></strong></span><br /><br /><br /><strong><span style=\"font-size: 14pt; font-family: 微软雅黑;\">7. About the performance issues:</span></strong><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">We are aware of a series of performance issues our players have experienced (e.g. lags, freezes, frame rate drops, device overheating, blurry graphics, crashes, or force quits) and we are working to identify the causes and address these issues.</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">In addition, we have included fixes to some of the most urgent issues with the broadest impact (e.g. login failures or overheating) in an emergency patch to ensure the stability of the game for most players. However, if you continue to experience serious overheating or frequent crashes in the current version, please consider checking your device load status via [Settings] - [Graphics] and lower the graphics settings in the case of an overload for a smoother gaming experience.</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">Lastly, our team would like to thank all players again for your support and understanding.&nbsp;</span><br /><br /><span style=\"font-size: 14pt; font-family: 微软雅黑;\">Please rest assured that we are dedicated to providing the best possible experience for our players, and we take performance concerns seriously. In future updates, we will continue to optimize the game's performance to improve your gaming experience. Please stay tuned to our upcoming notices and announcements.&nbsp;</span></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>",
  "articleCover": "",
  "articleId": 777,
  "articleTitle": "Wuthering Waves List of Known Issues (Updated on May 23rd)",
  "articleType": 58,
  "articleTypeName": "Notice",
  "contentCover": "",
  "gameId": "G152-en",
  "startTime": "2024-05-24 04:00:00"
}
