{
  "articleContent": "<div>\n<p><span style=\"font-family: 微软雅黑; font-size: 14pt;\">Dear Rovers,</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">We have been paying close attention to feedback from players all over the globe, regarding any gameplay issues that may have arisen. We are committed to continuously fixing these issues through hotfixes. To express our sincere apology, we will be issuing another compensation: Radiant Tide*10 on 05/25 10:00 (UTC+8).</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">✦Compensation: Radiant Tide*10</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">✦Scope of Compensation: Rovers who have reached Union Level 2 or above by 2024/07/03 03:59 (UTC+8)</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">In addition to the list of known issues and their corresponding improvement plans that we shared yesterday, we would also like to share our future plans for addressing a few other key concerns:</span><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">(1) Optimize the Skip function</span></strong><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">We have received your feedback regarding the Skip function including \"not enough skippable scenes,\" \"UI design of the Skip button not readable enough,\" and \"the main quest storyline feeling lengthy.\" We plan to optimize your experience by introducing support for skipping all types of scenes in storylines and reviewing functions for storyline scripts and cutscenes.&nbsp; See the details below:</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">1. Redesign the [Skip] function UI button;</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">2. Largely increase the skippable scenes in the main quest storylines, including the prologue and chapter 1.</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">3.&nbsp; Support the skipping of character dialogs outside of cutscenes and cinematics.</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">4. The Companion Story for Resonator Yinlin will be available in-game soon.</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">Due to technical constraints, we're unable to support the skipping of cutscenes. Sorry for any negative experience this may bring. We appreciate your understanding!</span><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">(2) Optimize the combat experience</span></strong><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">With regard to the issues that frequently come up in the feedback of all Rovers, including the lack of signification of combat actions, lack of visual feedback of action impacts, poor controller combat experience, and visual blockage during the combat by environmental objects. We have scheduled dedicated optimization of different combat scenes with the goal of improving the positive feedback for players in the combat experience. Additionally, we are also working on improving the functional support of controllers and expediting the support of customized buttons of controllers.</span><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">(3) Additional Custom 5-Star Standard Resonator Giveback Convene event</span></strong><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">After the launch, we have received much feedback across all platforms and channels regarding the Beginner's Choice Convene. We are deeply sorry for the unsatisfactory experience the event has brought you. Therefore, we plan to issue a special item [Voucher of Reciprocal Tides] which grants a free chance to obtain one 5-Star Standard Resonator of your choice via in-game mail on 05/26 10:00 (UTC+8). This event is available until 2025/05/22 11:59 (UTC+8). Please watch out for our in-game announcement regarding the detailed event rules.</span><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">(4) Further optimizations are scheduled along with more, fresh content</span></strong><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">We have already scheduled further optimizations of the game and the development of new functions and gameplay elements down the pipeline. These include the optimization of the art assets of certain NPCs, a new layered map display function, and more Echo transformations. Please stay tuned.&nbsp;</span><br /><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">Please be assured that your voices and feedback are essential to us. If you have any issues, please reach out to our Customer Support via email at <span style=\"color: #e67e23;\"><strong><a style=\"color: #e67e23;\" href=\"wutheringwaves_ensupport@kurogames.com\">wutheringwaves_ensupport@kurogames.com</a></strong></span>. As always, we appreciate your interest and support of Wuthering Waves!</span><br /><br /><br /></p>\n<p style=\"text-align: right;\"><span style=\"font-family: 微软雅黑; font-size: 14pt;\">Wuthering Waves Dev Team</span></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n</div>",
  "articleId": 790,
  "articleTitle": "Regarding Gameplay Issues and Our Future Improvement Plans",
  "articleType": 58,
  "articleTypeName": "Notice",
  "endTime": "2099-01-01 00:00:00",
  "gameId": "G152-en",
  "startTime": "2024-05-24 23:00:00",
  "articleDesc": "",
  "createTime": "2024-05-24 22:53:49",
  "sortingMark": 235,
  "suggestCover": "",
  "top": 0
}