{
  "articleContent": "<div>\n<p><span style=\"font-family: 微软雅黑; font-size: 14pt;\">Dear Rovers,</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">Greetings, we are the Wuthering Waves Dev Team. Since the official launch of Wuthering Waves, we have received a lot of valuable feedback and suggestions through social media and in-game surveys. We are genuinely grateful for your attention and support.</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">We apologize for the deficiencies and issues present in Wuthering Waves, our first fully independently developed and globally published game at Kuro Games. We understand that this has affected your gaming experience, and we are working to improve it for those who love the game.</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">We have been working on optimizations and iterations for the current 1.0 version, and the development of subsequent version updates is also underway. Below, we will address some of the most discussed and concerned issues.</span><br /><br /><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">I. On the Echo Development Experience</span></strong><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">(1) Echo Development feels grindy and inadequate energy materials</span></strong><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">We are aware of the common concern in the community that the current Echo leveling experience feels too&nbsp; grindy and the game lacks a Waveplates storage system. We have confirmed and will implement the following adjustments while we are working internally on solutions to address other common concerns.</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">1. In the current version, we will launch a limited-time Echo material double yield event \"Chord Cleansing\";</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">2. In version 1.1, we will adjust the progression system to reduce the Shell Credit costs of Echo development;</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">3. In version 1.1, we will remove the reward cutscene of the Tacet Field;</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">4. From version 1.1 and forward, the yield of Echoes and Echo development materials will be increased;</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">5. In upcoming updates, we will introduce the Waveplates storage system.</span><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">(2) Regarding our handling of the reward system error when recycling developed Echoes</span></strong><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">On May 29, 2024, we were notified of an issue with the Echo recycling system where the amount of Shell Credits players obtained when recycling developed Echoes was wrong. Since this is an issue that directly impacts the game's balance, we fixed this problem through an emergency live update on the same night and issued compensation to all players. As part of the measures to minimize the event's impact on the fairness within the player community, we informed the players of the situation and announced that we would remove all additional Shell Credits obtained unexpectedly as a result of this bug within 14 business days and issue compensations accordingly.</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">However, due to the urgency of this issue, we failed to issue an announcement of this issue in the first instance, which regrettably caused negative experiences for our players. We sincerely apologize for our improper way of handling this situation and the inconvenience caused.</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">Following an internal discussion, we have decided to compensate all players with the Shell Credit based on the maximum amount of Shell Credit that had been unexpectedly yielded through this bug to address the negative impact caused. We will round up to the nearest whole number and provide <strong>extra compensation </strong>to all players: <strong>Shell Credit &times;1,000,000</strong>.</span><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">✦Distribution Time: By 23:59 on June 10, 2024 (UTC+8)</span></strong><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">✦Eligibility: Character created and mailbox function unlocked before 10:00 on May 30, 2024 (UTC+8). The compensation is valid until 05:59 on July 3, 2024 (UTC+8).</span></strong><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">We apologize again for the hasty way we handled this issue and for any inappropriate wording in our announcements. We promise that all our future decisions shall reflect thorough consideration and professionalism.&nbsp;</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">Additionally, to address the poor experience with the Echo system, we will compensate all Rovers with <strong>Crystal Solvents &times;20 (1 Crystal Solvent = 60 Waveplates)</strong>. Thank you for your understanding and support!</span><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">✦Distribution Time: 10:00 on June 3, 2024 (UTC+8)</span></strong><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">✦Eligibility: Mail function unlocked. The compensation is valid until 05:59 on June 28, 2024 (UTC+8).</span></strong><br /><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">II. On the Error in 5-Star Weapon Description</span></strong><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">As has been discovered by our players, the description of the 5-Star Weapon \"Verdant Summit\" in the game in certain languages contained a mistranslation. Upon discovering this issue, we promptly corrected the description and issued compensations to all Rovers. We have also initiated a comprehensive internal review of the localized versions of the in-game texts across all the languages that we support. Any corrections or improvements made during the process will be included in the upcoming updates. We sincerely apologize for this mistake and want to reassure you that we're committed to continuously improving the quality of our localization to better the experience for all Rovers.</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">In the meantime, we will offer <strong>a one-time compensation of Forging Tides &times;5</strong> to all Rovers for the known localization issue.</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">As we endeavor to constantly improve the localization quality across different languages, we encourage you to provide us with your comments or suggestions on improving the localization and the experience of players worldwide through in-game feedback channels or our Customer Support. Thank you for your patience and understanding.</span><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">✦Distribution Time: 10:00 on June 3, 2024 (UTC+8)</span></strong><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">✦Eligibility: Mail function unlocked. The compensation is valid until 05:59 on June 28, 2024 (UTC+8).</span></strong><br /><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">III. On Version Events</span></strong><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">We have received extensive feedback on the duration and rewards of the \"Overdash Club\" event. To address your concerns, we are currently in the process of redesigning the rules and reward schemes for the upcoming events and the immediate solutions are as below:</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">1. We will introduce a new limited-time<strong> special event: \"Wuthering Exploration\" to offer new rewards and content to improve your gaming experience</strong>.</span><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">✦Event Duration: 2024-06-13 10:00 to 2024-06-27 03:59 (server time)</span></strong><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">✦Event Rewards: Astrites &times;800 + Morphable Elite Class Echo I + Morphable Elite Class Echo II + Premium Tuner + Premium Sealed Tube</span></strong><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">2. Moving forward, we shall ensure we make greater collective endeavors internally in designing the version events to improve the event content, quality, and rewards for your better experience.</span><br /><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">IV. On Future Version Updates Timeline</span></strong><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">Since the official launch of Wuthering Waves, we have received extensive feedback regarding the game's storyline, localization, and various other aspects. We have been listening closely and are grateful for the continued enthusiasm and support from our players, which has exceeded our expectations.</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">To allow everyone early access to experience more content and features of Wuthering Waves in version 1.0, we have decided to advance the release of subsequent content in version 1.0, starting on <strong>June 6, 2024, at 10:00 (UTC+8)</strong>. This release will include the Companion Story \"Solitary Path\" for Resonator Yinlin, the Featured Resonator Convene event \"When Thunder Pours\" for Yinlin, the limited-time challenge event \"Alloy Smelt\" along with many more spin-off events and features.</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">Wuthering Waves Version 1.0 will last until <strong>June 28, 2024, at 05:59 (UTC+8)</strong>, after which we will schedule a server downtime and implement the update for Wuthering Waves Version 1.1 \"Thaw of Eons\", which will include a <strong>new area \"Mt. Firmament,\" new Resonators \"Jinhsi\" and \"Changli,\" and a new boss \"Ju&eacute;.\"</strong></span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">To compensate for any inconvenience caused by this version timing adjustment, we will issue compensation to all Rovers: <strong>Radiant Tide &times;10</strong>. Thank you for your understanding and continued support. For detailed information on the event time adjustments, please refer to the in-game announcements.</span><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">✦Distribution Time: 10:00 on June 3, 2024 (UTC+8)</span></strong><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">✦Eligibility: Mail function unlocked. The compensation is valid until 05:59 on June 28, 2024 (UTC+8).</span></strong><br /><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">V. On Combat and Control Experience Optimization</span></strong><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">We have heard your feedback regarding the poor experience with autoaiming and auto lock-on, controls, key remapping requirements, and game feel design. Based on the issues that repeatedly come up in player discussions, we have identified the following issues and will address them accordingly, while working on a solution to other known issues not listed below.</span><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">(1) Autoaiming/Auto Lock-on and Camera Performance In Battle</span></strong><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">In the recent updates, we have disabled the \"Combat Camera Correction\" feature on PC by default. We have also optimized the default values and ranges for combat camera settings.</span><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">(2) Bosses Existing Combat State Unexpectedly</span></strong><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">1. In recent updates, we have optimized the aggro ranges for certain bosses, including \"Thundering Mephis,\" \"Crownless,\" \"Lampylumen Myriad,\" and \"Impermanence Heron\" and adjusted the prerequisites for enemies to leave the combat combat state to reduce abnormal disengagements.&nbsp;</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">2. In upcoming updates, we will introduce a \"Disengagement Warning\" feature.</span><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">(3) Ghost Touch Issues on Mobile</span></strong><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">1. In recent updates, we have expanded the anti-ghost touch area around buttons.</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">2. Future versions will include further optimizations for mobile controls.</span><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">(4) Delayed Availability of Custom Keybinding Feature</span></strong><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">1. In version 1.1, the prerequisite to unlock the \"Custom Keybinding\" feature will be lowered to Union Level 2.</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">2. We will also introduce a new player tutorial for using the \"Custom Keybinding\" feature, and we will gradually support more custom keybinding options for both keyboard/mouse and controller modes.</span><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">(5) Controller Mode Experience Optimization</span></strong><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">1. In version 1.1, we will remap the current controller shortcut of \"Open Chat\" to \"Open Map\" and add an option to invert the Y-axis.</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">2. Future versions will support \"Controller Mode\" on mobile devices.</span><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">(6) Poor Game Feel Design and Impact Signification</span></strong><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">In future versions, we will constantly improve the event signification and game feel design for characters and monsters, enhancing the overall combat experience and positive feedback during battles.</span><br /><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">VI. On Other Contents</span></strong><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">(1) No Purchase Limits for Store Items Like \"Flour\", Leading to Accidental Purchases</span></strong><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">In recent updates, we have added a \"Weekly Purchase Limit\" for certain items in the store.</span><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">(2) Audio and Sound Effect Bugs</span></strong><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">In recent updates, we have addressed issues regarding missing sound effects and excessively loud ambient sounds. We have completed some investigations and updates to fix these issues. We will continue to optimize the audio experience to provide a more immersive audiovisual experience.</span><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">(3) Performance Issues: Crashes and Instability</span></strong><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">In recent updates, we have fixed crash and instability issues affecting certain devices. We are currently identifying the causes of other crash reports and will continue to implement fixes. We apologize for any inconvenience this may have caused. We are committed to ongoing performance optimization. If you encounter related issues when gaming, please contact Customer Support for assistance.</span><br /><br /><strong><span style=\"font-family: 微软雅黑; font-size: 14pt;\">(4) \"Depths of Illusive Realm\" Event Optimization and Updates</span></strong><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">We have received numerous player feedback and suggestions regarding the \"Depths of Illusive Realm\" event in version 1.0. In the upcoming version 1.1 update, we will further improve this event and add new content, including more playable characters, new challenges, new mechanics, and new buffs.</span><br /><br /><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">Apart from the adjustments mentioned above, we recognize that there are still many issues in the game that affect player experience. We are committed to listening to every single piece of feedback, continuously organizing, optimizing, and resolving these issues to make Wuthering Waves better.</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">We will share and communicate future updates and optimization progress with you actively. Additionally, we will continue to gather player feedback through version surveys.</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">Since Wuthering Wave's official global launch, we have been disheartened by our inability to provide a high-quality gaming experience to all Rovers. We understand that continuously releasing better versions and content is our goal and mission, and we will always strive to uphold them.</span><br /><br /><span style=\"font-family: 微软雅黑; font-size: 14pt;\">Finally, we sincerely thank all Rovers for your continuous attention and unwavering support for Wuthering Waves.</span><br /><br /><br /><br /></p>\n<p style=\"text-align: right;\"><span style=\"font-family: 微软雅黑; font-size: 14pt;\">Wuthering Waves Dev Team</span></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n</div>",
  "articleCover": "",
  "articleId": 827,
  "articleTitle": "Announcement on \"Wuthering Waves\" 1.0 Version and Future Adjustment Directions",
  "articleType": 58,
  "articleTypeName": "Notice",
  "contentCover": "",
  "gameId": "G152-en",
  "startTime": "2024-06-02 18:04:09",
  "articleDesc": "",
  "createTime": "2024-06-02 18:01:56",
  "sortingMark": 232,
  "suggestCover": "",
  "top": 0
}